/* automatically generated by rust-bindgen */

pub const _STDIO_H: ::std::os::raw::c_uint = 1;
pub const _FEATURES_H: ::std::os::raw::c_uint = 1;
pub const _DEFAULT_SOURCE: ::std::os::raw::c_uint = 1;
pub const __USE_ISOC11: ::std::os::raw::c_uint = 1;
pub const __USE_ISOC99: ::std::os::raw::c_uint = 1;
pub const __USE_ISOC95: ::std::os::raw::c_uint = 1;
pub const __USE_POSIX_IMPLICITLY: ::std::os::raw::c_uint = 1;
pub const _POSIX_SOURCE: ::std::os::raw::c_uint = 1;
pub const _POSIX_C_SOURCE: ::std::os::raw::c_uint = 200809;
pub const __USE_POSIX: ::std::os::raw::c_uint = 1;
pub const __USE_POSIX2: ::std::os::raw::c_uint = 1;
pub const __USE_POSIX199309: ::std::os::raw::c_uint = 1;
pub const __USE_POSIX199506: ::std::os::raw::c_uint = 1;
pub const __USE_XOPEN2K: ::std::os::raw::c_uint = 1;
pub const __USE_XOPEN2K8: ::std::os::raw::c_uint = 1;
pub const _ATFILE_SOURCE: ::std::os::raw::c_uint = 1;
pub const __USE_MISC: ::std::os::raw::c_uint = 1;
pub const __USE_ATFILE: ::std::os::raw::c_uint = 1;
pub const __USE_FORTIFY_LEVEL: ::std::os::raw::c_uint = 0;
pub const _STDC_PREDEF_H: ::std::os::raw::c_uint = 1;
pub const __STDC_IEC_559__: ::std::os::raw::c_uint = 1;
pub const __STDC_IEC_559_COMPLEX__: ::std::os::raw::c_uint = 1;
pub const __STDC_ISO_10646__: ::std::os::raw::c_uint = 201505;
pub const __STDC_NO_THREADS__: ::std::os::raw::c_uint = 1;
pub const __GNU_LIBRARY__: ::std::os::raw::c_uint = 6;
pub const __GLIBC__: ::std::os::raw::c_uint = 2;

pub const SIZE_FACT_HASH: ::std::os::raw::c_uint = 16231;
pub const FACTS_DATA: ::std::os::raw::c_uint = 3;
pub const DEFGLOBAL_DATA: ::std::os::raw::c_uint = 1;
pub const DEFFUNCTION_DATA: ::std::os::raw::c_uint = 23;
pub const DEFGENERIC_DATA: ::std::os::raw::c_uint = 27;
pub const MAX_TRAVERSALS: ::std::os::raw::c_uint = 256;
pub const TRAVERSAL_BYTES: ::std::os::raw::c_uint = 32;
pub const VALUE_REQUIRED: ::std::os::raw::c_uint = 0;
pub const VALUE_PROHIBITED: ::std::os::raw::c_uint = 1;
pub const VALUE_NOT_REQUIRED: ::std::os::raw::c_uint = 2;
pub const CLASS_TABLE_HASH_SIZE: ::std::os::raw::c_uint = 167;
pub const SLOT_NAME_TABLE_HASH_SIZE: ::std::os::raw::c_uint = 167;
pub const ISA_ID: ::std::os::raw::c_uint = 0;
pub const NAME_ID: ::std::os::raw::c_uint = 1;
pub const DEFCLASS_DATA: ::std::os::raw::c_uint = 21;
pub const PRIMITIVE_CLASSES: ::std::os::raw::c_uint = 9;
pub const DEFINSTANCES_DATA: ::std::os::raw::c_uint = 22;
pub const INSTANCE_TABLE_HASH_SIZE: ::std::os::raw::c_uint = 8191;
pub const INSTANCE_DATA: ::std::os::raw::c_uint = 29;
pub const INSTANCE_FILE_DATA: ::std::os::raw::c_uint = 30;
pub const MESSAGE_HANDLER_DATA: ::std::os::raw::c_uint = 32;
pub const INIT_STRING: &'static [u8; 5usize] = b"init\x00";
pub const DELETE_STRING: &'static [u8; 7usize] = b"delete\x00";
pub const PRINT_STRING: &'static [u8; 6usize] = b"print\x00";
pub const CREATE_STRING: &'static [u8; 7usize] = b"create\x00";
pub const OBJECT_ASSERT: ::std::os::raw::c_uint = 1;
pub const OBJECT_RETRACT: ::std::os::raw::c_uint = 2;
pub const OBJECT_MODIFY: ::std::os::raw::c_uint = 3;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    assert_eq!(::std::mem::size_of::<__fsid_t>() , 8usize , concat ! (
               "Size of: " , stringify ! ( __fsid_t ) ));
    assert_eq! (::std::mem::align_of::<__fsid_t>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( __fsid_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __fsid_t ) ) . __val as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( __fsid_t ) , "::" ,
                stringify ! ( __val ) ));
}
impl Clone for __fsid_t {
    fn clone(&self) -> Self { *self }
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __qaddr_t = *mut __quad_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct _IO_FILE {
    pub _flags: ::std::os::raw::c_int,
    pub _IO_read_ptr: *mut ::std::os::raw::c_char,
    pub _IO_read_end: *mut ::std::os::raw::c_char,
    pub _IO_read_base: *mut ::std::os::raw::c_char,
    pub _IO_write_base: *mut ::std::os::raw::c_char,
    pub _IO_write_ptr: *mut ::std::os::raw::c_char,
    pub _IO_write_end: *mut ::std::os::raw::c_char,
    pub _IO_buf_base: *mut ::std::os::raw::c_char,
    pub _IO_buf_end: *mut ::std::os::raw::c_char,
    pub _IO_save_base: *mut ::std::os::raw::c_char,
    pub _IO_backup_base: *mut ::std::os::raw::c_char,
    pub _IO_save_end: *mut ::std::os::raw::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: ::std::os::raw::c_int,
    pub _flags2: ::std::os::raw::c_int,
    pub _old_offset: __off_t,
    pub _cur_column: ::std::os::raw::c_ushort,
    pub _vtable_offset: ::std::os::raw::c_schar,
    pub _shortbuf: [::std::os::raw::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub __pad1: *mut ::std::os::raw::c_void,
    pub __pad2: *mut ::std::os::raw::c_void,
    pub __pad3: *mut ::std::os::raw::c_void,
    pub __pad4: *mut ::std::os::raw::c_void,
    pub __pad5: usize,
    pub _mode: ::std::os::raw::c_int,
    pub _unused2: [::std::os::raw::c_char; 20usize],
}
#[test]
fn bindgen_test_layout__IO_FILE() {
    assert_eq!(::std::mem::size_of::<_IO_FILE>() , 216usize , concat ! (
               "Size of: " , stringify ! ( _IO_FILE ) ));
    assert_eq! (::std::mem::align_of::<_IO_FILE>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( _IO_FILE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _flags as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_read_ptr as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_read_ptr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_read_end as * const _
                as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_read_end ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_read_base as * const _
                as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_read_base ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_write_base as * const
                _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_write_base ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_write_ptr as * const _
                as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_write_ptr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_write_end as * const _
                as usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_write_end ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_buf_base as * const _
                as usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_buf_base ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_buf_end as * const _
                as usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_buf_end ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_save_base as * const _
                as usize } , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_save_base ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_backup_base as * const
                _ as usize } , 80usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_backup_base ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_save_end as * const _
                as usize } , 88usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_save_end ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _markers as * const _ as
                usize } , 96usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _markers ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _chain as * const _ as
                usize } , 104usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _chain ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _fileno as * const _ as
                usize } , 112usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _fileno ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _flags2 as * const _ as
                usize } , 116usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _flags2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _old_offset as * const _
                as usize } , 120usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _old_offset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _cur_column as * const _
                as usize } , 128usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _cur_column ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _vtable_offset as * const
                _ as usize } , 130usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _vtable_offset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _shortbuf as * const _ as
                usize } , 131usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _shortbuf ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _lock as * const _ as
                usize } , 136usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _lock ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _offset as * const _ as
                usize } , 144usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _offset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . __pad1 as * const _ as
                usize } , 152usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( __pad1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . __pad2 as * const _ as
                usize } , 160usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( __pad2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . __pad3 as * const _ as
                usize } , 168usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( __pad3 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . __pad4 as * const _ as
                usize } , 176usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( __pad4 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . __pad5 as * const _ as
                usize } , 184usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( __pad5 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _mode as * const _ as
                usize } , 192usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _mode ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _unused2 as * const _ as
                usize } , 196usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _unused2 ) ));
}
impl Clone for _IO_FILE {
    fn clone(&self) -> Self { *self }
}
pub type FILE = _IO_FILE;
pub type __FILE = _IO_FILE;
#[repr(C)]
#[derive(Copy)]
pub struct __mbstate_t {
    pub __count: ::std::os::raw::c_int,
    pub __value: __mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy)]
pub union __mbstate_t__bindgen_ty_1 {
    pub __wch: ::std::os::raw::c_uint,
    pub __wchb: [::std::os::raw::c_char; 4usize],
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout___mbstate_t__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<__mbstate_t__bindgen_ty_1>() , 4usize ,
               concat ! (
               "Size of: " , stringify ! ( __mbstate_t__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<__mbstate_t__bindgen_ty_1>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( __mbstate_t__bindgen_ty_1 )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __mbstate_t__bindgen_ty_1 ) ) . __wch as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                __mbstate_t__bindgen_ty_1 ) , "::" , stringify ! ( __wch ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __mbstate_t__bindgen_ty_1 ) ) . __wchb as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                __mbstate_t__bindgen_ty_1 ) , "::" , stringify ! ( __wchb )
                ));
}
impl Clone for __mbstate_t__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout___mbstate_t() {
    assert_eq!(::std::mem::size_of::<__mbstate_t>() , 8usize , concat ! (
               "Size of: " , stringify ! ( __mbstate_t ) ));
    assert_eq! (::std::mem::align_of::<__mbstate_t>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( __mbstate_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __mbstate_t ) ) . __count as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( __mbstate_t ) , "::" ,
                stringify ! ( __count ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __mbstate_t ) ) . __value as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( __mbstate_t ) , "::" ,
                stringify ! ( __value ) ));
}
impl Clone for __mbstate_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub struct _G_fpos_t {
    pub __pos: __off_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos_t() {
    assert_eq!(::std::mem::size_of::<_G_fpos_t>() , 16usize , concat ! (
               "Size of: " , stringify ! ( _G_fpos_t ) ));
    assert_eq! (::std::mem::align_of::<_G_fpos_t>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( _G_fpos_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _G_fpos_t ) ) . __pos as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _G_fpos_t ) , "::" ,
                stringify ! ( __pos ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _G_fpos_t ) ) . __state as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( _G_fpos_t ) , "::" ,
                stringify ! ( __state ) ));
}
impl Clone for _G_fpos_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub struct _G_fpos64_t {
    pub __pos: __off64_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos64_t() {
    assert_eq!(::std::mem::size_of::<_G_fpos64_t>() , 16usize , concat ! (
               "Size of: " , stringify ! ( _G_fpos64_t ) ));
    assert_eq! (::std::mem::align_of::<_G_fpos64_t>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( _G_fpos64_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _G_fpos64_t ) ) . __pos as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _G_fpos64_t ) , "::" ,
                stringify ! ( __pos ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _G_fpos64_t ) ) . __state as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( _G_fpos64_t ) , "::" ,
                stringify ! ( __state ) ));
}
impl Clone for _G_fpos64_t {
    fn clone(&self) -> Self { *self }
}
pub type va_list = __builtin_va_list;
pub type __gnuc_va_list = __builtin_va_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_jump_t {
    _unused: [u8; 0],
}
pub type _IO_lock_t = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct _IO_marker {
    pub _next: *mut _IO_marker,
    pub _sbuf: *mut _IO_FILE,
    pub _pos: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__IO_marker() {
    assert_eq!(::std::mem::size_of::<_IO_marker>() , 24usize , concat ! (
               "Size of: " , stringify ! ( _IO_marker ) ));
    assert_eq! (::std::mem::align_of::<_IO_marker>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( _IO_marker ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_marker ) ) . _next as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_marker ) , "::" ,
                stringify ! ( _next ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_marker ) ) . _sbuf as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_marker ) , "::" ,
                stringify ! ( _sbuf ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_marker ) ) . _pos as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_marker ) , "::" ,
                stringify ! ( _pos ) ));
}
impl Clone for _IO_marker {
    fn clone(&self) -> Self { *self }
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum __codecvt_result {
    __codecvt_ok = 0,
    __codecvt_partial = 1,
    __codecvt_error = 2,
    __codecvt_noconv = 3,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE_plus {
    _unused: [u8; 0],
}
extern "C" {
    #[link_name = "_IO_2_1_stdin_"]
    pub static mut _IO_2_1_stdin_: _IO_FILE_plus;
}
extern "C" {
    #[link_name = "_IO_2_1_stdout_"]
    pub static mut _IO_2_1_stdout_: _IO_FILE_plus;
}
extern "C" {
    #[link_name = "_IO_2_1_stderr_"]
    pub static mut _IO_2_1_stderr_: _IO_FILE_plus;
}
pub type __io_read_fn =
    ::std::option::Option<unsafe extern "C" fn(__cookie:
                                                   *mut ::std::os::raw::c_void,
                                               __buf:
                                                   *mut ::std::os::raw::c_char,
                                               __nbytes: usize) -> __ssize_t>;
pub type __io_write_fn =
    ::std::option::Option<unsafe extern "C" fn(__cookie:
                                                   *mut ::std::os::raw::c_void,
                                               __buf:
                                                   *const ::std::os::raw::c_char,
                                               __n: usize) -> __ssize_t>;
pub type __io_seek_fn =
    ::std::option::Option<unsafe extern "C" fn(__cookie:
                                                   *mut ::std::os::raw::c_void,
                                               __pos: *mut __off64_t,
                                               __w: ::std::os::raw::c_int)
                              -> ::std::os::raw::c_int>;
pub type __io_close_fn =
    ::std::option::Option<unsafe extern "C" fn(__cookie:
                                                   *mut ::std::os::raw::c_void)
                              -> ::std::os::raw::c_int>;
extern "C" {
    pub fn __underflow(arg1: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __uflow(arg1: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __overflow(arg1: *mut _IO_FILE, arg2: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_getc(__fp: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_putc(__c: ::std::os::raw::c_int, __fp: *mut _IO_FILE)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_feof(__fp: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_ferror(__fp: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_peekc_locked(__fp: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_flockfile(arg1: *mut _IO_FILE);
}
extern "C" {
    pub fn _IO_funlockfile(arg1: *mut _IO_FILE);
}
extern "C" {
    pub fn _IO_ftrylockfile(arg1: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_vfscanf(arg1: *mut _IO_FILE,
                       arg2: *const ::std::os::raw::c_char,
                       arg3: *mut __va_list_tag,
                       arg4: *mut ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_vfprintf(arg1: *mut _IO_FILE,
                        arg2: *const ::std::os::raw::c_char,
                        arg3: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_padn(arg1: *mut _IO_FILE, arg2: ::std::os::raw::c_int,
                    arg3: __ssize_t) -> __ssize_t;
}
extern "C" {
    pub fn _IO_sgetn(arg1: *mut _IO_FILE, arg2: *mut ::std::os::raw::c_void,
                     arg3: usize) -> usize;
}
extern "C" {
    pub fn _IO_seekoff(arg1: *mut _IO_FILE, arg2: __off64_t,
                       arg3: ::std::os::raw::c_int,
                       arg4: ::std::os::raw::c_int) -> __off64_t;
}
extern "C" {
    pub fn _IO_seekpos(arg1: *mut _IO_FILE, arg2: __off64_t,
                       arg3: ::std::os::raw::c_int) -> __off64_t;
}
extern "C" {
    pub fn _IO_free_backup_area(arg1: *mut _IO_FILE);
}
pub type off_t = __off_t;
pub type fpos_t = _G_fpos_t;
extern "C" {
    #[link_name = "stdin"]
    pub static mut stdin: *mut _IO_FILE;
}
extern "C" {
    #[link_name = "stdout"]
    pub static mut stdout: *mut _IO_FILE;
}
extern "C" {
    #[link_name = "stderr"]
    pub static mut stderr: *mut _IO_FILE;
}
extern "C" {
    pub fn remove(__filename: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rename(__old: *const ::std::os::raw::c_char,
                  __new: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn renameat(__oldfd: ::std::os::raw::c_int,
                    __old: *const ::std::os::raw::c_char,
                    __newfd: ::std::os::raw::c_int,
                    __new: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
extern "C" {
    pub fn tmpnam(__s: *mut ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tmpnam_r(__s: *mut ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tempnam(__dir: *const ::std::os::raw::c_char,
                   __pfx: *const ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fflush(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fflush_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fopen(__filename: *const ::std::os::raw::c_char,
                 __modes: *const ::std::os::raw::c_char) -> *mut FILE;
}
extern "C" {
    pub fn freopen(__filename: *const ::std::os::raw::c_char,
                   __modes: *const ::std::os::raw::c_char,
                   __stream: *mut FILE) -> *mut FILE;
}
extern "C" {
    pub fn fdopen(__fd: ::std::os::raw::c_int,
                  __modes: *const ::std::os::raw::c_char) -> *mut FILE;
}
extern "C" {
    pub fn fmemopen(__s: *mut ::std::os::raw::c_void, __len: usize,
                    __modes: *const ::std::os::raw::c_char) -> *mut FILE;
}
extern "C" {
    pub fn open_memstream(__bufloc: *mut *mut ::std::os::raw::c_char,
                          __sizeloc: *mut usize) -> *mut FILE;
}
extern "C" {
    pub fn setbuf(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn setvbuf(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char,
                   __modes: ::std::os::raw::c_int, __n: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setbuffer(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char,
                     __size: usize);
}
extern "C" {
    pub fn setlinebuf(__stream: *mut FILE);
}
extern "C" {
    pub fn fprintf(__stream: *mut FILE,
                   __format: *const ::std::os::raw::c_char, ...)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn printf(__format: *const ::std::os::raw::c_char, ...)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sprintf(__s: *mut ::std::os::raw::c_char,
                   __format: *const ::std::os::raw::c_char, ...)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfprintf(__s: *mut FILE, __format: *const ::std::os::raw::c_char,
                    __arg: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vprintf(__format: *const ::std::os::raw::c_char,
                   __arg: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsprintf(__s: *mut ::std::os::raw::c_char,
                    __format: *const ::std::os::raw::c_char,
                    __arg: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snprintf(__s: *mut ::std::os::raw::c_char, __maxlen: usize,
                    __format: *const ::std::os::raw::c_char, ...)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsnprintf(__s: *mut ::std::os::raw::c_char, __maxlen: usize,
                     __format: *const ::std::os::raw::c_char,
                     __arg: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vdprintf(__fd: ::std::os::raw::c_int,
                    __fmt: *const ::std::os::raw::c_char,
                    __arg: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dprintf(__fd: ::std::os::raw::c_int,
                   __fmt: *const ::std::os::raw::c_char, ...)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fscanf(__stream: *mut FILE,
                  __format: *const ::std::os::raw::c_char, ...)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn scanf(__format: *const ::std::os::raw::c_char, ...)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sscanf(__s: *const ::std::os::raw::c_char,
                  __format: *const ::std::os::raw::c_char, ...)
     -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "__isoc99_fscanf"]
    pub fn fscanf1(__stream: *mut FILE,
                   __format: *const ::std::os::raw::c_char, ...)
     -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "__isoc99_scanf"]
    pub fn scanf1(__format: *const ::std::os::raw::c_char, ...)
     -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "__isoc99_sscanf"]
    pub fn sscanf1(__s: *const ::std::os::raw::c_char,
                   __format: *const ::std::os::raw::c_char, ...)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfscanf(__s: *mut FILE, __format: *const ::std::os::raw::c_char,
                   __arg: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vscanf(__format: *const ::std::os::raw::c_char,
                  __arg: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsscanf(__s: *const ::std::os::raw::c_char,
                   __format: *const ::std::os::raw::c_char,
                   __arg: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "__isoc99_vfscanf"]
    pub fn vfscanf1(__s: *mut FILE, __format: *const ::std::os::raw::c_char,
                    __arg: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "__isoc99_vscanf"]
    pub fn vscanf1(__format: *const ::std::os::raw::c_char,
                   __arg: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "__isoc99_vsscanf"]
    pub fn vsscanf1(__s: *const ::std::os::raw::c_char,
                    __format: *const ::std::os::raw::c_char,
                    __arg: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar_unlocked() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc(__c: ::std::os::raw::c_int, __stream: *mut FILE)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc(__c: ::std::os::raw::c_int, __stream: *mut FILE)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar_unlocked(__c: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getw(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putw(__w: ::std::os::raw::c_int, __stream: *mut FILE)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgets(__s: *mut ::std::os::raw::c_char, __n: ::std::os::raw::c_int,
                 __stream: *mut FILE) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __getdelim(__lineptr: *mut *mut ::std::os::raw::c_char,
                      __n: *mut usize, __delimiter: ::std::os::raw::c_int,
                      __stream: *mut FILE) -> __ssize_t;
}
extern "C" {
    pub fn getdelim(__lineptr: *mut *mut ::std::os::raw::c_char,
                    __n: *mut usize, __delimiter: ::std::os::raw::c_int,
                    __stream: *mut FILE) -> __ssize_t;
}
extern "C" {
    pub fn getline(__lineptr: *mut *mut ::std::os::raw::c_char,
                   __n: *mut usize, __stream: *mut FILE) -> __ssize_t;
}
extern "C" {
    pub fn fputs(__s: *const ::std::os::raw::c_char, __stream: *mut FILE)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn puts(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ungetc(__c: ::std::os::raw::c_int, __stream: *mut FILE)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fread(__ptr: *mut ::std::os::raw::c_void, __size: usize,
                 __n: usize, __stream: *mut FILE) -> usize;
}
extern "C" {
    pub fn fwrite(__ptr: *const ::std::os::raw::c_void, __size: usize,
                  __n: usize, __s: *mut FILE) -> usize;
}
extern "C" {
    pub fn fread_unlocked(__ptr: *mut ::std::os::raw::c_void, __size: usize,
                          __n: usize, __stream: *mut FILE) -> usize;
}
extern "C" {
    pub fn fwrite_unlocked(__ptr: *const ::std::os::raw::c_void,
                           __size: usize, __n: usize, __stream: *mut FILE)
     -> usize;
}
extern "C" {
    pub fn fseek(__stream: *mut FILE, __off: ::std::os::raw::c_long,
                 __whence: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftell(__stream: *mut FILE) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn rewind(__stream: *mut FILE);
}
extern "C" {
    pub fn fseeko(__stream: *mut FILE, __off: __off_t,
                  __whence: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftello(__stream: *mut FILE) -> __off_t;
}
extern "C" {
    pub fn fgetpos(__stream: *mut FILE, __pos: *mut fpos_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fsetpos(__stream: *mut FILE, __pos: *const fpos_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearerr(__stream: *mut FILE);
}
extern "C" {
    pub fn feof(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearerr_unlocked(__stream: *mut FILE);
}
extern "C" {
    pub fn feof_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn perror(__s: *const ::std::os::raw::c_char);
}
extern "C" {
    #[link_name = "sys_nerr"]
    pub static mut sys_nerr: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "sys_errlist"]
    pub static mut sys_errlist: [*const ::std::os::raw::c_char; 0usize];
}
extern "C" {
    pub fn fileno(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fileno_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn popen(__command: *const ::std::os::raw::c_char,
                 __modes: *const ::std::os::raw::c_char) -> *mut FILE;
}
extern "C" {
    pub fn pclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ctermid(__s: *mut ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn flockfile(__stream: *mut FILE);
}
extern "C" {
    pub fn ftrylockfile(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn funlockfile(__stream: *mut FILE);
}
pub type wchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct div_t {
    pub quot: ::std::os::raw::c_int,
    pub rem: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_div_t() {
    assert_eq!(::std::mem::size_of::<div_t>() , 8usize , concat ! (
               "Size of: " , stringify ! ( div_t ) ));
    assert_eq! (::std::mem::align_of::<div_t>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( div_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const div_t ) ) . quot as * const _ as usize }
                , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( div_t ) , "::" ,
                stringify ! ( quot ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const div_t ) ) . rem as * const _ as usize } ,
                4usize , concat ! (
                "Alignment of field: " , stringify ! ( div_t ) , "::" ,
                stringify ! ( rem ) ));
}
impl Clone for div_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct ldiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_ldiv_t() {
    assert_eq!(::std::mem::size_of::<ldiv_t>() , 16usize , concat ! (
               "Size of: " , stringify ! ( ldiv_t ) ));
    assert_eq! (::std::mem::align_of::<ldiv_t>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( ldiv_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ldiv_t ) ) . quot as * const _ as usize }
                , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( ldiv_t ) , "::" ,
                stringify ! ( quot ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ldiv_t ) ) . rem as * const _ as usize }
                , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( ldiv_t ) , "::" ,
                stringify ! ( rem ) ));
}
impl Clone for ldiv_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct lldiv_t {
    pub quot: ::std::os::raw::c_longlong,
    pub rem: ::std::os::raw::c_longlong,
}
#[test]
fn bindgen_test_layout_lldiv_t() {
    assert_eq!(::std::mem::size_of::<lldiv_t>() , 16usize , concat ! (
               "Size of: " , stringify ! ( lldiv_t ) ));
    assert_eq! (::std::mem::align_of::<lldiv_t>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( lldiv_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const lldiv_t ) ) . quot as * const _ as usize
                } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( lldiv_t ) , "::" ,
                stringify ! ( quot ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const lldiv_t ) ) . rem as * const _ as usize }
                , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( lldiv_t ) , "::" ,
                stringify ! ( rem ) ));
}
impl Clone for lldiv_t {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    pub fn __ctype_get_mb_cur_max() -> usize;
}
extern "C" {
    pub fn atof(__nptr: *const ::std::os::raw::c_char) -> f64;
}
extern "C" {
    pub fn atoi(__nptr: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn atol(__nptr: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn atoll(__nptr: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtod(__nptr: *const ::std::os::raw::c_char,
                  __endptr: *mut *mut ::std::os::raw::c_char) -> f64;
}
extern "C" {
    pub fn strtof(__nptr: *const ::std::os::raw::c_char,
                  __endptr: *mut *mut ::std::os::raw::c_char) -> f32;
}
extern "C" {
    pub fn strtold(__nptr: *const ::std::os::raw::c_char,
                   __endptr: *mut *mut ::std::os::raw::c_char) -> f64;
}
extern "C" {
    pub fn strtol(__nptr: *const ::std::os::raw::c_char,
                  __endptr: *mut *mut ::std::os::raw::c_char,
                  __base: ::std::os::raw::c_int) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn strtoul(__nptr: *const ::std::os::raw::c_char,
                   __endptr: *mut *mut ::std::os::raw::c_char,
                   __base: ::std::os::raw::c_int) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strtoq(__nptr: *const ::std::os::raw::c_char,
                  __endptr: *mut *mut ::std::os::raw::c_char,
                  __base: ::std::os::raw::c_int)
     -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtouq(__nptr: *const ::std::os::raw::c_char,
                   __endptr: *mut *mut ::std::os::raw::c_char,
                   __base: ::std::os::raw::c_int)
     -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn strtoll(__nptr: *const ::std::os::raw::c_char,
                   __endptr: *mut *mut ::std::os::raw::c_char,
                   __base: ::std::os::raw::c_int)
     -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtoull(__nptr: *const ::std::os::raw::c_char,
                    __endptr: *mut *mut ::std::os::raw::c_char,
                    __base: ::std::os::raw::c_int)
     -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn l64a(__n: ::std::os::raw::c_long) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn a64l(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type pid_t = __pid_t;
pub type id_t = __id_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type clock_t = __clock_t;
pub type clockid_t = __clockid_t;
pub type time_t = __time_t;
pub type timer_t = __timer_t;
pub type ulong = ::std::os::raw::c_ulong;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type u_int8_t = ::std::os::raw::c_uchar;
pub type u_int16_t = ::std::os::raw::c_ushort;
pub type u_int32_t = ::std::os::raw::c_uint;
pub type u_int64_t = ::std::os::raw::c_ulong;
pub type register_t = ::std::os::raw::c_long;
pub type __sig_atomic_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[test]
fn bindgen_test_layout___sigset_t() {
    assert_eq!(::std::mem::size_of::<__sigset_t>() , 128usize , concat ! (
               "Size of: " , stringify ! ( __sigset_t ) ));
    assert_eq! (::std::mem::align_of::<__sigset_t>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( __sigset_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __sigset_t ) ) . __val as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( __sigset_t ) , "::" ,
                stringify ! ( __val ) ));
}
impl Clone for __sigset_t {
    fn clone(&self) -> Self { *self }
}
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[test]
fn bindgen_test_layout_timeval() {
    assert_eq!(::std::mem::size_of::<timeval>() , 16usize , concat ! (
               "Size of: " , stringify ! ( timeval ) ));
    assert_eq! (::std::mem::align_of::<timeval>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( timeval ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const timeval ) ) . tv_sec as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( timeval ) , "::" ,
                stringify ! ( tv_sec ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const timeval ) ) . tv_usec as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( timeval ) , "::" ,
                stringify ! ( tv_usec ) ));
}
impl Clone for timeval {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[test]
fn bindgen_test_layout_timespec() {
    assert_eq!(::std::mem::size_of::<timespec>() , 16usize , concat ! (
               "Size of: " , stringify ! ( timespec ) ));
    assert_eq! (::std::mem::align_of::<timespec>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( timespec ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const timespec ) ) . tv_sec as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( timespec ) , "::" ,
                stringify ! ( tv_sec ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const timespec ) ) . tv_nsec as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( timespec ) , "::" ,
                stringify ! ( tv_nsec ) ));
}
impl Clone for timespec {
    fn clone(&self) -> Self { *self }
}
pub type suseconds_t = __suseconds_t;
pub type __fd_mask = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 16usize],
}
#[test]
fn bindgen_test_layout_fd_set() {
    assert_eq!(::std::mem::size_of::<fd_set>() , 128usize , concat ! (
               "Size of: " , stringify ! ( fd_set ) ));
    assert_eq! (::std::mem::align_of::<fd_set>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( fd_set ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const fd_set ) ) . __fds_bits as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( fd_set ) , "::" ,
                stringify ! ( __fds_bits ) ));
}
impl Clone for fd_set {
    fn clone(&self) -> Self { *self }
}
pub type fd_mask = __fd_mask;
extern "C" {
    pub fn select(__nfds: ::std::os::raw::c_int, __readfds: *mut fd_set,
                  __writefds: *mut fd_set, __exceptfds: *mut fd_set,
                  __timeout: *mut timeval) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pselect(__nfds: ::std::os::raw::c_int, __readfds: *mut fd_set,
                   __writefds: *mut fd_set, __exceptfds: *mut fd_set,
                   __timeout: *const timespec, __sigmask: *const __sigset_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gnu_dev_major(__dev: __dev_t) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn gnu_dev_minor(__dev: __dev_t) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn gnu_dev_makedev(__major: ::std::os::raw::c_uint,
                           __minor: ::std::os::raw::c_uint) -> __dev_t;
}
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
pub type pthread_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Copy)]
pub union pthread_attr_t {
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: [u64; 7usize],
}
#[test]
fn bindgen_test_layout_pthread_attr_t() {
    assert_eq!(::std::mem::size_of::<pthread_attr_t>() , 56usize , concat ! (
               "Size of: " , stringify ! ( pthread_attr_t ) ));
    assert_eq! (::std::mem::align_of::<pthread_attr_t>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( pthread_attr_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_attr_t ) ) . __size as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_attr_t ) , "::"
                , stringify ! ( __size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_attr_t ) ) . __align as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_attr_t ) , "::"
                , stringify ! ( __align ) ));
}
impl Clone for pthread_attr_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[test]
fn bindgen_test_layout___pthread_internal_list() {
    assert_eq!(::std::mem::size_of::<__pthread_internal_list>() , 16usize ,
               concat ! (
               "Size of: " , stringify ! ( __pthread_internal_list ) ));
    assert_eq! (::std::mem::align_of::<__pthread_internal_list>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( __pthread_internal_list ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __pthread_internal_list ) ) . __prev as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( __pthread_internal_list
                ) , "::" , stringify ! ( __prev ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __pthread_internal_list ) ) . __next as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( __pthread_internal_list
                ) , "::" , stringify ! ( __next ) ));
}
impl Clone for __pthread_internal_list {
    fn clone(&self) -> Self { *self }
}
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Copy)]
pub union pthread_mutex_t {
    pub __data: pthread_mutex_t___pthread_mutex_s,
    pub __size: [::std::os::raw::c_char; 40usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: [u64; 5usize],
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct pthread_mutex_t___pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __kind: ::std::os::raw::c_int,
    pub __spins: ::std::os::raw::c_short,
    pub __elision: ::std::os::raw::c_short,
    pub __list: __pthread_list_t,
}
#[test]
fn bindgen_test_layout_pthread_mutex_t___pthread_mutex_s() {
    assert_eq!(::std::mem::size_of::<pthread_mutex_t___pthread_mutex_s>() ,
               40usize , concat ! (
               "Size of: " , stringify ! ( pthread_mutex_t___pthread_mutex_s )
               ));
    assert_eq! (::std::mem::align_of::<pthread_mutex_t___pthread_mutex_s>() ,
                8usize , concat ! (
                "Alignment of " , stringify ! (
                pthread_mutex_t___pthread_mutex_s ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutex_t___pthread_mutex_s ) ) .
                __lock as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_mutex_t___pthread_mutex_s ) , "::" , stringify ! (
                __lock ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutex_t___pthread_mutex_s ) ) .
                __count as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_mutex_t___pthread_mutex_s ) , "::" , stringify ! (
                __count ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutex_t___pthread_mutex_s ) ) .
                __owner as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_mutex_t___pthread_mutex_s ) , "::" , stringify ! (
                __owner ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutex_t___pthread_mutex_s ) ) .
                __nusers as * const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_mutex_t___pthread_mutex_s ) , "::" , stringify ! (
                __nusers ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutex_t___pthread_mutex_s ) ) .
                __kind as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_mutex_t___pthread_mutex_s ) , "::" , stringify ! (
                __kind ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutex_t___pthread_mutex_s ) ) .
                __spins as * const _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_mutex_t___pthread_mutex_s ) , "::" , stringify ! (
                __spins ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutex_t___pthread_mutex_s ) ) .
                __elision as * const _ as usize } , 22usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_mutex_t___pthread_mutex_s ) , "::" , stringify ! (
                __elision ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutex_t___pthread_mutex_s ) ) .
                __list as * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_mutex_t___pthread_mutex_s ) , "::" , stringify ! (
                __list ) ));
}
impl Clone for pthread_mutex_t___pthread_mutex_s {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_pthread_mutex_t() {
    assert_eq!(::std::mem::size_of::<pthread_mutex_t>() , 40usize , concat ! (
               "Size of: " , stringify ! ( pthread_mutex_t ) ));
    assert_eq! (::std::mem::align_of::<pthread_mutex_t>() , 8usize , concat !
                ( "Alignment of " , stringify ! ( pthread_mutex_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutex_t ) ) . __data as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_mutex_t ) ,
                "::" , stringify ! ( __data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutex_t ) ) . __size as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_mutex_t ) ,
                "::" , stringify ! ( __size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutex_t ) ) . __align as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_mutex_t ) ,
                "::" , stringify ! ( __align ) ));
}
impl Clone for pthread_mutex_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub union pthread_mutexattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_pthread_mutexattr_t() {
    assert_eq!(::std::mem::size_of::<pthread_mutexattr_t>() , 4usize , concat
               ! ( "Size of: " , stringify ! ( pthread_mutexattr_t ) ));
    assert_eq! (::std::mem::align_of::<pthread_mutexattr_t>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( pthread_mutexattr_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutexattr_t ) ) . __size as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_mutexattr_t ) ,
                "::" , stringify ! ( __size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutexattr_t ) ) . __align as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_mutexattr_t ) ,
                "::" , stringify ! ( __align ) ));
}
impl Clone for pthread_mutexattr_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub union pthread_cond_t {
    pub __data: pthread_cond_t__bindgen_ty_1,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_longlong,
    _bindgen_union_align: [u64; 6usize],
}
#[repr(C)]
#[derive(Copy)]
pub struct pthread_cond_t__bindgen_ty_1 {
    pub __bindgen_anon_1: pthread_cond_t__bindgen_ty_1__bindgen_ty_1,
    pub __bindgen_anon_2: pthread_cond_t__bindgen_ty_1__bindgen_ty_2,
    pub __g_refs: [::std::os::raw::c_uint; 2usize],
    pub __g_size: [::std::os::raw::c_uint; 2usize],
    pub __g1_orig_size: ::std::os::raw::c_uint,
    pub __wrefs: ::std::os::raw::c_uint,
    pub __g_signals: [::std::os::raw::c_uint; 2usize],
}
#[repr(C)]
#[derive(Copy)]
pub union pthread_cond_t__bindgen_ty_1__bindgen_ty_1 {
    pub __wseq: ::std::os::raw::c_ulonglong,
    pub __wseq32: pthread_cond_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
    _bindgen_union_align: u64,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct pthread_cond_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_pthread_cond_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<pthread_cond_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1>()
               , 8usize , concat ! (
               "Size of: " , stringify ! (
               pthread_cond_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<pthread_cond_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1>()
                , 4usize , concat ! (
                "Alignment of " , stringify ! (
                pthread_cond_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & (
                * (
                0 as * const
                pthread_cond_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1 ) ) .
                __low as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_cond_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1 ) ,
                "::" , stringify ! ( __low ) ));
    assert_eq! (unsafe {
                & (
                * (
                0 as * const
                pthread_cond_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1 ) ) .
                __high as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_cond_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1 ) ,
                "::" , stringify ! ( __high ) ));
}
impl Clone for pthread_cond_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_pthread_cond_t__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<pthread_cond_t__bindgen_ty_1__bindgen_ty_1>()
               , 8usize , concat ! (
               "Size of: " , stringify ! (
               pthread_cond_t__bindgen_ty_1__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<pthread_cond_t__bindgen_ty_1__bindgen_ty_1>()
                , 8usize , concat ! (
                "Alignment of " , stringify ! (
                pthread_cond_t__bindgen_ty_1__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & (
                * ( 0 as * const pthread_cond_t__bindgen_ty_1__bindgen_ty_1 )
                ) . __wseq as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_cond_t__bindgen_ty_1__bindgen_ty_1 ) , "::" ,
                stringify ! ( __wseq ) ));
    assert_eq! (unsafe {
                & (
                * ( 0 as * const pthread_cond_t__bindgen_ty_1__bindgen_ty_1 )
                ) . __wseq32 as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_cond_t__bindgen_ty_1__bindgen_ty_1 ) , "::" ,
                stringify ! ( __wseq32 ) ));
}
impl Clone for pthread_cond_t__bindgen_ty_1__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub union pthread_cond_t__bindgen_ty_1__bindgen_ty_2 {
    pub __g1_start: ::std::os::raw::c_ulonglong,
    pub __g1_start32: pthread_cond_t__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1,
    _bindgen_union_align: u64,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct pthread_cond_t__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_pthread_cond_t__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<pthread_cond_t__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1>()
               , 8usize , concat ! (
               "Size of: " , stringify ! (
               pthread_cond_t__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<pthread_cond_t__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1>()
                , 4usize , concat ! (
                "Alignment of " , stringify ! (
                pthread_cond_t__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & (
                * (
                0 as * const
                pthread_cond_t__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1 ) ) .
                __low as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_cond_t__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1 ) ,
                "::" , stringify ! ( __low ) ));
    assert_eq! (unsafe {
                & (
                * (
                0 as * const
                pthread_cond_t__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1 ) ) .
                __high as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_cond_t__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1 ) ,
                "::" , stringify ! ( __high ) ));
}
impl Clone for pthread_cond_t__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_pthread_cond_t__bindgen_ty_1__bindgen_ty_2() {
    assert_eq!(::std::mem::size_of::<pthread_cond_t__bindgen_ty_1__bindgen_ty_2>()
               , 8usize , concat ! (
               "Size of: " , stringify ! (
               pthread_cond_t__bindgen_ty_1__bindgen_ty_2 ) ));
    assert_eq! (::std::mem::align_of::<pthread_cond_t__bindgen_ty_1__bindgen_ty_2>()
                , 8usize , concat ! (
                "Alignment of " , stringify ! (
                pthread_cond_t__bindgen_ty_1__bindgen_ty_2 ) ));
    assert_eq! (unsafe {
                & (
                * ( 0 as * const pthread_cond_t__bindgen_ty_1__bindgen_ty_2 )
                ) . __g1_start as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_cond_t__bindgen_ty_1__bindgen_ty_2 ) , "::" ,
                stringify ! ( __g1_start ) ));
    assert_eq! (unsafe {
                & (
                * ( 0 as * const pthread_cond_t__bindgen_ty_1__bindgen_ty_2 )
                ) . __g1_start32 as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_cond_t__bindgen_ty_1__bindgen_ty_2 ) , "::" ,
                stringify ! ( __g1_start32 ) ));
}
impl Clone for pthread_cond_t__bindgen_ty_1__bindgen_ty_2 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_pthread_cond_t__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<pthread_cond_t__bindgen_ty_1>() , 48usize
               , concat ! (
               "Size of: " , stringify ! ( pthread_cond_t__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<pthread_cond_t__bindgen_ty_1>() ,
                8usize , concat ! (
                "Alignment of " , stringify ! ( pthread_cond_t__bindgen_ty_1 )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_cond_t__bindgen_ty_1 ) ) .
                __g_refs as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_cond_t__bindgen_ty_1 ) , "::" , stringify ! ( __g_refs
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_cond_t__bindgen_ty_1 ) ) .
                __g_size as * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_cond_t__bindgen_ty_1 ) , "::" , stringify ! ( __g_size
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_cond_t__bindgen_ty_1 ) ) .
                __g1_orig_size as * const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_cond_t__bindgen_ty_1 ) , "::" , stringify ! (
                __g1_orig_size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_cond_t__bindgen_ty_1 ) ) .
                __wrefs as * const _ as usize } , 36usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_cond_t__bindgen_ty_1 ) , "::" , stringify ! ( __wrefs
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_cond_t__bindgen_ty_1 ) ) .
                __g_signals as * const _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_cond_t__bindgen_ty_1 ) , "::" , stringify ! (
                __g_signals ) ));
}
impl Clone for pthread_cond_t__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_pthread_cond_t() {
    assert_eq!(::std::mem::size_of::<pthread_cond_t>() , 48usize , concat ! (
               "Size of: " , stringify ! ( pthread_cond_t ) ));
    assert_eq! (::std::mem::align_of::<pthread_cond_t>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( pthread_cond_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_cond_t ) ) . __data as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_cond_t ) , "::"
                , stringify ! ( __data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_cond_t ) ) . __size as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_cond_t ) , "::"
                , stringify ! ( __size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_cond_t ) ) . __align as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_cond_t ) , "::"
                , stringify ! ( __align ) ));
}
impl Clone for pthread_cond_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub union pthread_condattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_pthread_condattr_t() {
    assert_eq!(::std::mem::size_of::<pthread_condattr_t>() , 4usize , concat !
               ( "Size of: " , stringify ! ( pthread_condattr_t ) ));
    assert_eq! (::std::mem::align_of::<pthread_condattr_t>() , 4usize , concat
                ! ( "Alignment of " , stringify ! ( pthread_condattr_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_condattr_t ) ) . __size as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_condattr_t ) ,
                "::" , stringify ! ( __size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_condattr_t ) ) . __align as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_condattr_t ) ,
                "::" , stringify ! ( __align ) ));
}
impl Clone for pthread_condattr_t {
    fn clone(&self) -> Self { *self }
}
pub type pthread_key_t = ::std::os::raw::c_uint;
pub type pthread_once_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy)]
pub union pthread_rwlock_t {
    pub __data: pthread_rwlock_t__bindgen_ty_1,
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: [u64; 7usize],
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct pthread_rwlock_t__bindgen_ty_1 {
    pub __readers: ::std::os::raw::c_uint,
    pub __writers: ::std::os::raw::c_uint,
    pub __wrphase_futex: ::std::os::raw::c_uint,
    pub __writers_futex: ::std::os::raw::c_uint,
    pub __pad3: ::std::os::raw::c_uint,
    pub __pad4: ::std::os::raw::c_uint,
    pub __cur_writer: ::std::os::raw::c_int,
    pub __shared: ::std::os::raw::c_int,
    pub __rwelision: ::std::os::raw::c_schar,
    pub __pad1: [::std::os::raw::c_uchar; 7usize],
    pub __pad2: ::std::os::raw::c_ulong,
    pub __flags: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_pthread_rwlock_t__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<pthread_rwlock_t__bindgen_ty_1>() ,
               56usize , concat ! (
               "Size of: " , stringify ! ( pthread_rwlock_t__bindgen_ty_1 )
               ));
    assert_eq! (::std::mem::align_of::<pthread_rwlock_t__bindgen_ty_1>() ,
                8usize , concat ! (
                "Alignment of " , stringify ! ( pthread_rwlock_t__bindgen_ty_1
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __readers as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! (
                __readers ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __writers as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! (
                __writers ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __wrphase_futex as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! (
                __wrphase_futex ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __writers_futex as * const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! (
                __writers_futex ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __pad3 as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! ( __pad3
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __pad4 as * const _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! ( __pad4
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __cur_writer as * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! (
                __cur_writer ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __shared as * const _ as usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! (
                __shared ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __rwelision as * const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! (
                __rwelision ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __pad1 as * const _ as usize } , 33usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! ( __pad1
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __pad2 as * const _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! ( __pad2
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __flags as * const _ as usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! (
                __flags ) ));
}
impl Clone for pthread_rwlock_t__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_pthread_rwlock_t() {
    assert_eq!(::std::mem::size_of::<pthread_rwlock_t>() , 56usize , concat !
               ( "Size of: " , stringify ! ( pthread_rwlock_t ) ));
    assert_eq! (::std::mem::align_of::<pthread_rwlock_t>() , 8usize , concat !
                ( "Alignment of " , stringify ! ( pthread_rwlock_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t ) ) . __data as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_rwlock_t ) ,
                "::" , stringify ! ( __data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t ) ) . __size as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_rwlock_t ) ,
                "::" , stringify ! ( __size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t ) ) . __align as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_rwlock_t ) ,
                "::" , stringify ! ( __align ) ));
}
impl Clone for pthread_rwlock_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub union pthread_rwlockattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_pthread_rwlockattr_t() {
    assert_eq!(::std::mem::size_of::<pthread_rwlockattr_t>() , 8usize , concat
               ! ( "Size of: " , stringify ! ( pthread_rwlockattr_t ) ));
    assert_eq! (::std::mem::align_of::<pthread_rwlockattr_t>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( pthread_rwlockattr_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlockattr_t ) ) . __size as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_rwlockattr_t )
                , "::" , stringify ! ( __size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlockattr_t ) ) . __align as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_rwlockattr_t )
                , "::" , stringify ! ( __align ) ));
}
impl Clone for pthread_rwlockattr_t {
    fn clone(&self) -> Self { *self }
}
pub type pthread_spinlock_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy)]
pub union pthread_barrier_t {
    pub __size: [::std::os::raw::c_char; 32usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: [u64; 4usize],
}
#[test]
fn bindgen_test_layout_pthread_barrier_t() {
    assert_eq!(::std::mem::size_of::<pthread_barrier_t>() , 32usize , concat !
               ( "Size of: " , stringify ! ( pthread_barrier_t ) ));
    assert_eq! (::std::mem::align_of::<pthread_barrier_t>() , 8usize , concat
                ! ( "Alignment of " , stringify ! ( pthread_barrier_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_barrier_t ) ) . __size as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_barrier_t ) ,
                "::" , stringify ! ( __size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_barrier_t ) ) . __align as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_barrier_t ) ,
                "::" , stringify ! ( __align ) ));
}
impl Clone for pthread_barrier_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub union pthread_barrierattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_pthread_barrierattr_t() {
    assert_eq!(::std::mem::size_of::<pthread_barrierattr_t>() , 4usize ,
               concat ! ( "Size of: " , stringify ! ( pthread_barrierattr_t )
               ));
    assert_eq! (::std::mem::align_of::<pthread_barrierattr_t>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( pthread_barrierattr_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_barrierattr_t ) ) . __size as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_barrierattr_t )
                , "::" , stringify ! ( __size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_barrierattr_t ) ) . __align as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_barrierattr_t )
                , "::" , stringify ! ( __align ) ));
}
impl Clone for pthread_barrierattr_t {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    pub fn random() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn srandom(__seed: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn initstate(__seed: ::std::os::raw::c_uint,
                     __statebuf: *mut ::std::os::raw::c_char,
                     __statelen: usize) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn setstate(__statebuf: *mut ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct random_data {
    pub fptr: *mut i32,
    pub rptr: *mut i32,
    pub state: *mut i32,
    pub rand_type: ::std::os::raw::c_int,
    pub rand_deg: ::std::os::raw::c_int,
    pub rand_sep: ::std::os::raw::c_int,
    pub end_ptr: *mut i32,
}
#[test]
fn bindgen_test_layout_random_data() {
    assert_eq!(::std::mem::size_of::<random_data>() , 48usize , concat ! (
               "Size of: " , stringify ! ( random_data ) ));
    assert_eq! (::std::mem::align_of::<random_data>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( random_data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const random_data ) ) . fptr as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( random_data ) , "::" ,
                stringify ! ( fptr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const random_data ) ) . rptr as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( random_data ) , "::" ,
                stringify ! ( rptr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const random_data ) ) . state as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( random_data ) , "::" ,
                stringify ! ( state ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const random_data ) ) . rand_type as * const _
                as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( random_data ) , "::" ,
                stringify ! ( rand_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const random_data ) ) . rand_deg as * const _
                as usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! ( random_data ) , "::" ,
                stringify ! ( rand_deg ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const random_data ) ) . rand_sep as * const _
                as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( random_data ) , "::" ,
                stringify ! ( rand_sep ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const random_data ) ) . end_ptr as * const _ as
                usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( random_data ) , "::" ,
                stringify ! ( end_ptr ) ));
}
impl Clone for random_data {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    pub fn random_r(__buf: *mut random_data, __result: *mut i32)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srandom_r(__seed: ::std::os::raw::c_uint, __buf: *mut random_data)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn initstate_r(__seed: ::std::os::raw::c_uint,
                       __statebuf: *mut ::std::os::raw::c_char,
                       __statelen: usize, __buf: *mut random_data)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setstate_r(__statebuf: *mut ::std::os::raw::c_char,
                      __buf: *mut random_data) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rand() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srand(__seed: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn rand_r(__seed: *mut ::std::os::raw::c_uint)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn drand48() -> f64;
}
extern "C" {
    pub fn erand48(__xsubi: *mut ::std::os::raw::c_ushort) -> f64;
}
extern "C" {
    pub fn lrand48() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn nrand48(__xsubi: *mut ::std::os::raw::c_ushort)
     -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn mrand48() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn jrand48(__xsubi: *mut ::std::os::raw::c_ushort)
     -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn srand48(__seedval: ::std::os::raw::c_long);
}
extern "C" {
    pub fn seed48(__seed16v: *mut ::std::os::raw::c_ushort)
     -> *mut ::std::os::raw::c_ushort;
}
extern "C" {
    pub fn lcong48(__param: *mut ::std::os::raw::c_ushort);
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct drand48_data {
    pub __x: [::std::os::raw::c_ushort; 3usize],
    pub __old_x: [::std::os::raw::c_ushort; 3usize],
    pub __c: ::std::os::raw::c_ushort,
    pub __init: ::std::os::raw::c_ushort,
    pub __a: ::std::os::raw::c_ulonglong,
}
#[test]
fn bindgen_test_layout_drand48_data() {
    assert_eq!(::std::mem::size_of::<drand48_data>() , 24usize , concat ! (
               "Size of: " , stringify ! ( drand48_data ) ));
    assert_eq! (::std::mem::align_of::<drand48_data>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( drand48_data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const drand48_data ) ) . __x as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( drand48_data ) , "::" ,
                stringify ! ( __x ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const drand48_data ) ) . __old_x as * const _
                as usize } , 6usize , concat ! (
                "Alignment of field: " , stringify ! ( drand48_data ) , "::" ,
                stringify ! ( __old_x ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const drand48_data ) ) . __c as * const _ as
                usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( drand48_data ) , "::" ,
                stringify ! ( __c ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const drand48_data ) ) . __init as * const _ as
                usize } , 14usize , concat ! (
                "Alignment of field: " , stringify ! ( drand48_data ) , "::" ,
                stringify ! ( __init ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const drand48_data ) ) . __a as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( drand48_data ) , "::" ,
                stringify ! ( __a ) ));
}
impl Clone for drand48_data {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    pub fn drand48_r(__buffer: *mut drand48_data, __result: *mut f64)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn erand48_r(__xsubi: *mut ::std::os::raw::c_ushort,
                     __buffer: *mut drand48_data, __result: *mut f64)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lrand48_r(__buffer: *mut drand48_data,
                     __result: *mut ::std::os::raw::c_long)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn nrand48_r(__xsubi: *mut ::std::os::raw::c_ushort,
                     __buffer: *mut drand48_data,
                     __result: *mut ::std::os::raw::c_long)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mrand48_r(__buffer: *mut drand48_data,
                     __result: *mut ::std::os::raw::c_long)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn jrand48_r(__xsubi: *mut ::std::os::raw::c_ushort,
                     __buffer: *mut drand48_data,
                     __result: *mut ::std::os::raw::c_long)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srand48_r(__seedval: ::std::os::raw::c_long,
                     __buffer: *mut drand48_data) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn seed48_r(__seed16v: *mut ::std::os::raw::c_ushort,
                    __buffer: *mut drand48_data) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lcong48_r(__param: *mut ::std::os::raw::c_ushort,
                     __buffer: *mut drand48_data) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn malloc(__size: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn calloc(__nmemb: usize, __size: usize)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn realloc(__ptr: *mut ::std::os::raw::c_void, __size: usize)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn free(__ptr: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn cfree(__ptr: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn alloca(__size: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn valloc(__size: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn posix_memalign(__memptr: *mut *mut ::std::os::raw::c_void,
                          __alignment: usize, __size: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aligned_alloc(__alignment: usize, __size: usize)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn abort();
}
extern "C" {
    pub fn atexit(__func: ::std::option::Option<unsafe extern "C" fn()>)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn at_quick_exit(__func:
                             ::std::option::Option<unsafe extern "C" fn()>)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn on_exit(__func:
                       ::std::option::Option<unsafe extern "C" fn(__status:
                                                                      ::std::os::raw::c_int,
                                                                  __arg:
                                                                      *mut ::std::os::raw::c_void)>,
                   __arg: *mut ::std::os::raw::c_void)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn exit(__status: ::std::os::raw::c_int);
}
extern "C" {
    pub fn quick_exit(__status: ::std::os::raw::c_int);
}
extern "C" {
    pub fn _Exit(__status: ::std::os::raw::c_int);
}
extern "C" {
    pub fn getenv(__name: *const ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn putenv(__string: *mut ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setenv(__name: *const ::std::os::raw::c_char,
                  __value: *const ::std::os::raw::c_char,
                  __replace: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn unsetenv(__name: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearenv() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mktemp(__template: *mut ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn mkstemp(__template: *mut ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkstemps(__template: *mut ::std::os::raw::c_char,
                    __suffixlen: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkdtemp(__template: *mut ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn system(__command: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn realpath(__name: *const ::std::os::raw::c_char,
                    __resolved: *mut ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
pub type __compar_fn_t =
    ::std::option::Option<unsafe extern "C" fn(arg1:
                                                   *const ::std::os::raw::c_void,
                                               arg2:
                                                   *const ::std::os::raw::c_void)
                              -> ::std::os::raw::c_int>;
extern "C" {
    pub fn bsearch(__key: *const ::std::os::raw::c_void,
                   __base: *const ::std::os::raw::c_void, __nmemb: usize,
                   __size: usize, __compar: __compar_fn_t)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn qsort(__base: *mut ::std::os::raw::c_void, __nmemb: usize,
                 __size: usize, __compar: __compar_fn_t);
}
extern "C" {
    pub fn abs(__x: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn labs(__x: ::std::os::raw::c_long) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn llabs(__x: ::std::os::raw::c_longlong)
     -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn div(__numer: ::std::os::raw::c_int, __denom: ::std::os::raw::c_int)
     -> div_t;
}
extern "C" {
    pub fn ldiv(__numer: ::std::os::raw::c_long,
                __denom: ::std::os::raw::c_long) -> ldiv_t;
}
extern "C" {
    pub fn lldiv(__numer: ::std::os::raw::c_longlong,
                 __denom: ::std::os::raw::c_longlong) -> lldiv_t;
}
extern "C" {
    pub fn ecvt(__value: f64, __ndigit: ::std::os::raw::c_int,
                __decpt: *mut ::std::os::raw::c_int,
                __sign: *mut ::std::os::raw::c_int)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fcvt(__value: f64, __ndigit: ::std::os::raw::c_int,
                __decpt: *mut ::std::os::raw::c_int,
                __sign: *mut ::std::os::raw::c_int)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn gcvt(__value: f64, __ndigit: ::std::os::raw::c_int,
                __buf: *mut ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qecvt(__value: f64, __ndigit: ::std::os::raw::c_int,
                 __decpt: *mut ::std::os::raw::c_int,
                 __sign: *mut ::std::os::raw::c_int)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qfcvt(__value: f64, __ndigit: ::std::os::raw::c_int,
                 __decpt: *mut ::std::os::raw::c_int,
                 __sign: *mut ::std::os::raw::c_int)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qgcvt(__value: f64, __ndigit: ::std::os::raw::c_int,
                 __buf: *mut ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ecvt_r(__value: f64, __ndigit: ::std::os::raw::c_int,
                  __decpt: *mut ::std::os::raw::c_int,
                  __sign: *mut ::std::os::raw::c_int,
                  __buf: *mut ::std::os::raw::c_char, __len: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fcvt_r(__value: f64, __ndigit: ::std::os::raw::c_int,
                  __decpt: *mut ::std::os::raw::c_int,
                  __sign: *mut ::std::os::raw::c_int,
                  __buf: *mut ::std::os::raw::c_char, __len: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn qecvt_r(__value: f64, __ndigit: ::std::os::raw::c_int,
                   __decpt: *mut ::std::os::raw::c_int,
                   __sign: *mut ::std::os::raw::c_int,
                   __buf: *mut ::std::os::raw::c_char, __len: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn qfcvt_r(__value: f64, __ndigit: ::std::os::raw::c_int,
                   __decpt: *mut ::std::os::raw::c_int,
                   __sign: *mut ::std::os::raw::c_int,
                   __buf: *mut ::std::os::raw::c_char, __len: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mblen(__s: *const ::std::os::raw::c_char, __n: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mbtowc(__pwc: *mut wchar_t, __s: *const ::std::os::raw::c_char,
                  __n: usize) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wctomb(__s: *mut ::std::os::raw::c_char, __wchar: wchar_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mbstowcs(__pwcs: *mut wchar_t, __s: *const ::std::os::raw::c_char,
                    __n: usize) -> usize;
}
extern "C" {
    pub fn wcstombs(__s: *mut ::std::os::raw::c_char, __pwcs: *const wchar_t,
                    __n: usize) -> usize;
}
extern "C" {
    pub fn rpmatch(__response: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getsubopt(__optionp: *mut *mut ::std::os::raw::c_char,
                     __tokens: *const *const ::std::os::raw::c_char,
                     __valuep: *mut *mut ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getloadavg(__loadavg: *mut f64, __nelem: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct environmentData {
    pub _bitfield_1: u8,
    pub context: *mut ::std::os::raw::c_void,
    pub TrueSymbol: *mut CLIPSLexeme,
    pub FalseSymbol: *mut CLIPSLexeme,
    pub VoidConstant: *mut CLIPSVoid,
    pub theData: *mut *mut ::std::os::raw::c_void,
    pub cleanupFunctions: *mut ::std::option::Option<unsafe extern "C" fn(arg1:
                                                                              *mut Environment)>,
    pub listOfCleanupEnvironmentFunctions: *mut environmentCleanupFunction,
    pub next: *mut environmentData,
}
#[test]
fn bindgen_test_layout_environmentData() {
    assert_eq!(::std::mem::size_of::<environmentData>() , 72usize , concat ! (
               "Size of: " , stringify ! ( environmentData ) ));
    assert_eq! (::std::mem::align_of::<environmentData>() , 8usize , concat !
                ( "Alignment of " , stringify ! ( environmentData ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const environmentData ) ) . context as * const
                _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( environmentData ) ,
                "::" , stringify ! ( context ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const environmentData ) ) . TrueSymbol as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( environmentData ) ,
                "::" , stringify ! ( TrueSymbol ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const environmentData ) ) . FalseSymbol as *
                const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( environmentData ) ,
                "::" , stringify ! ( FalseSymbol ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const environmentData ) ) . VoidConstant as *
                const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( environmentData ) ,
                "::" , stringify ! ( VoidConstant ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const environmentData ) ) . theData as * const
                _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( environmentData ) ,
                "::" , stringify ! ( theData ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const environmentData ) ) . cleanupFunctions as
                * const _ as usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( environmentData ) ,
                "::" , stringify ! ( cleanupFunctions ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const environmentData ) ) .
                listOfCleanupEnvironmentFunctions as * const _ as usize } ,
                56usize , concat ! (
                "Alignment of field: " , stringify ! ( environmentData ) ,
                "::" , stringify ! ( listOfCleanupEnvironmentFunctions ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const environmentData ) ) . next as * const _
                as usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( environmentData ) ,
                "::" , stringify ! ( next ) ));
}
impl Clone for environmentData {
    fn clone(&self) -> Self { *self }
}
impl environmentData {
    #[inline]
    pub fn initialized(&self) -> ::std::os::raw::c_uint {
        let mut unit_field_val: u8 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u8 as
                                                *mut u8,
                                            ::std::mem::size_of::<u8>())
        };
        let mask = 1u64 as u8;
        let val = (unit_field_val & mask) >> 0usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_initialized(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 1u64 as u8;
        let val = val as u32 as u8;
        let mut unit_field_val: u8 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u8 as
                                                *mut u8,
                                            ::std::mem::size_of::<u8>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 0usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as
                                                *const u8,
                                            &mut self._bitfield_1 as *mut _ as
                                                *mut u8,
                                            ::std::mem::size_of::<u8>());
        }
    }
    #[inline]
    pub fn new_bitfield_1(initialized: ::std::os::raw::c_uint) -> u8 {
        ({ 0 } | ((initialized as u32 as u8) << 0usize) & (1u64 as u8))
    }
}
pub type Environment = environmentData;
pub type EnvironmentCleanupFunction =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut Environment)>;

#[repr(C)]
#[derive(Debug, Copy)]
pub struct clipsVoid {
    pub header: TypeHeader,
}
#[test]
fn bindgen_test_layout_clipsVoid() {
    assert_eq!(::std::mem::size_of::<clipsVoid>() , 2usize , concat ! (
               "Size of: " , stringify ! ( clipsVoid ) ));
    assert_eq! (::std::mem::align_of::<clipsVoid>() , 2usize , concat ! (
                "Alignment of " , stringify ! ( clipsVoid ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const clipsVoid ) ) . header as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( clipsVoid ) , "::" ,
                stringify ! ( header ) ));
}
impl Clone for clipsVoid {
    fn clone(&self) -> Self { *self }
}
pub type CLIPSVoid = clipsVoid;

#[repr(C)]
#[derive(Debug, Copy)]
pub struct clipsLexeme {
    pub header: TypeHeader,
    pub next: *mut CLIPSLexeme,
    pub count: ::std::os::raw::c_long,
    pub _bitfield_1: u32,
    pub contents: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_clipsLexeme() {
    assert_eq!(::std::mem::size_of::<clipsLexeme>() , 40usize , concat ! (
               "Size of: " , stringify ! ( clipsLexeme ) ));
    assert_eq! (::std::mem::align_of::<clipsLexeme>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( clipsLexeme ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const clipsLexeme ) ) . header as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( clipsLexeme ) , "::" ,
                stringify ! ( header ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const clipsLexeme ) ) . next as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( clipsLexeme ) , "::" ,
                stringify ! ( next ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const clipsLexeme ) ) . count as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( clipsLexeme ) , "::" ,
                stringify ! ( count ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const clipsLexeme ) ) . contents as * const _
                as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( clipsLexeme ) , "::" ,
                stringify ! ( contents ) ));
}
impl Clone for clipsLexeme {
    fn clone(&self) -> Self { *self }
}
impl clipsLexeme {
    #[inline]
    pub fn permanent(&self) -> ::std::os::raw::c_uint {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 1u64 as u32;
        let val = (unit_field_val & mask) >> 0usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_permanent(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 1u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 0usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as
                                                *const u8,
                                            &mut self._bitfield_1 as *mut _ as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn markedEphemeral(&self) -> ::std::os::raw::c_uint {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 2u64 as u32;
        let val = (unit_field_val & mask) >> 1usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_markedEphemeral(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 2u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 1usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as
                                                *const u8,
                                            &mut self._bitfield_1 as *mut _ as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn neededSymbol(&self) -> ::std::os::raw::c_uint {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 4u64 as u32;
        let val = (unit_field_val & mask) >> 2usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_neededSymbol(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 4u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 2usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as
                                                *const u8,
                                            &mut self._bitfield_1 as *mut _ as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn bucket(&self) -> ::std::os::raw::c_uint {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 4294967288u64 as u32;
        let val = (unit_field_val & mask) >> 3usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_bucket(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 4294967288u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 3usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as
                                                *const u8,
                                            &mut self._bitfield_1 as *mut _ as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn new_bitfield_1(permanent: ::std::os::raw::c_uint,
                          markedEphemeral: ::std::os::raw::c_uint,
                          neededSymbol: ::std::os::raw::c_uint,
                          bucket: ::std::os::raw::c_uint) -> u32 {
        ({
             ({
                  ({
                       ({ 0 } |
                            ((permanent as u32 as u32) << 0usize) &
                                (1u64 as u32))
                   } |
                       ((markedEphemeral as u32 as u32) << 1usize) &
                           (2u64 as u32))
              } | ((neededSymbol as u32 as u32) << 2usize) & (4u64 as u32))
         } | ((bucket as u32 as u32) << 3usize) & (4294967288u64 as u32))
    }
}
pub type CLIPSLexeme = clipsLexeme;

#[repr(C)]
#[derive(Debug, Copy)]
pub struct clipsFloat {
    pub header: TypeHeader,
    pub next: *mut CLIPSFloat,
    pub count: ::std::os::raw::c_long,
    pub _bitfield_1: u32,
    pub contents: f64,
}
#[test]
fn bindgen_test_layout_clipsFloat() {
    assert_eq!(::std::mem::size_of::<clipsFloat>() , 40usize , concat ! (
               "Size of: " , stringify ! ( clipsFloat ) ));
    assert_eq! (::std::mem::align_of::<clipsFloat>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( clipsFloat ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const clipsFloat ) ) . header as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( clipsFloat ) , "::" ,
                stringify ! ( header ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const clipsFloat ) ) . next as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( clipsFloat ) , "::" ,
                stringify ! ( next ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const clipsFloat ) ) . count as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( clipsFloat ) , "::" ,
                stringify ! ( count ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const clipsFloat ) ) . contents as * const _ as
                usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( clipsFloat ) , "::" ,
                stringify ! ( contents ) ));
}
impl Clone for clipsFloat {
    fn clone(&self) -> Self { *self }
}
impl clipsFloat {
    #[inline]
    pub fn permanent(&self) -> ::std::os::raw::c_uint {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 1u64 as u32;
        let val = (unit_field_val & mask) >> 0usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_permanent(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 1u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 0usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as
                                                *const u8,
                                            &mut self._bitfield_1 as *mut _ as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn markedEphemeral(&self) -> ::std::os::raw::c_uint {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 2u64 as u32;
        let val = (unit_field_val & mask) >> 1usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_markedEphemeral(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 2u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 1usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as
                                                *const u8,
                                            &mut self._bitfield_1 as *mut _ as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn neededFloat(&self) -> ::std::os::raw::c_uint {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 4u64 as u32;
        let val = (unit_field_val & mask) >> 2usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_neededFloat(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 4u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 2usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as
                                                *const u8,
                                            &mut self._bitfield_1 as *mut _ as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn bucket(&self) -> ::std::os::raw::c_uint {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 4294967288u64 as u32;
        let val = (unit_field_val & mask) >> 3usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_bucket(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 4294967288u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 3usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as
                                                *const u8,
                                            &mut self._bitfield_1 as *mut _ as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn new_bitfield_1(permanent: ::std::os::raw::c_uint,
                          markedEphemeral: ::std::os::raw::c_uint,
                          neededFloat: ::std::os::raw::c_uint,
                          bucket: ::std::os::raw::c_uint) -> u32 {
        ({
             ({
                  ({
                       ({ 0 } |
                            ((permanent as u32 as u32) << 0usize) &
                                (1u64 as u32))
                   } |
                       ((markedEphemeral as u32 as u32) << 1usize) &
                           (2u64 as u32))
              } | ((neededFloat as u32 as u32) << 2usize) & (4u64 as u32))
         } | ((bucket as u32 as u32) << 3usize) & (4294967288u64 as u32))
    }
}
pub type CLIPSFloat = clipsFloat;

#[repr(C)]
#[derive(Debug, Copy)]
pub struct clipsInteger {
    pub header: TypeHeader,
    pub next: *mut CLIPSInteger,
    pub count: ::std::os::raw::c_long,
    pub _bitfield_1: u32,
    pub contents: ::std::os::raw::c_longlong,
}
#[test]
fn bindgen_test_layout_clipsInteger() {
    assert_eq!(::std::mem::size_of::<clipsInteger>() , 40usize , concat ! (
               "Size of: " , stringify ! ( clipsInteger ) ));
    assert_eq! (::std::mem::align_of::<clipsInteger>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( clipsInteger ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const clipsInteger ) ) . header as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( clipsInteger ) , "::" ,
                stringify ! ( header ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const clipsInteger ) ) . next as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( clipsInteger ) , "::" ,
                stringify ! ( next ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const clipsInteger ) ) . count as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( clipsInteger ) , "::" ,
                stringify ! ( count ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const clipsInteger ) ) . contents as * const _
                as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( clipsInteger ) , "::" ,
                stringify ! ( contents ) ));
}
impl Clone for clipsInteger {
    fn clone(&self) -> Self { *self }
}
impl clipsInteger {
    #[inline]
    pub fn permanent(&self) -> ::std::os::raw::c_uint {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 1u64 as u32;
        let val = (unit_field_val & mask) >> 0usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_permanent(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 1u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 0usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as
                                                *const u8,
                                            &mut self._bitfield_1 as *mut _ as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn markedEphemeral(&self) -> ::std::os::raw::c_uint {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 2u64 as u32;
        let val = (unit_field_val & mask) >> 1usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_markedEphemeral(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 2u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 1usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as
                                                *const u8,
                                            &mut self._bitfield_1 as *mut _ as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn neededInteger(&self) -> ::std::os::raw::c_uint {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 4u64 as u32;
        let val = (unit_field_val & mask) >> 2usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_neededInteger(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 4u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 2usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as
                                                *const u8,
                                            &mut self._bitfield_1 as *mut _ as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn bucket(&self) -> ::std::os::raw::c_uint {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 4294967288u64 as u32;
        let val = (unit_field_val & mask) >> 3usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_bucket(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 4294967288u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 3usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as
                                                *const u8,
                                            &mut self._bitfield_1 as *mut _ as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn new_bitfield_1(permanent: ::std::os::raw::c_uint,
                          markedEphemeral: ::std::os::raw::c_uint,
                          neededInteger: ::std::os::raw::c_uint,
                          bucket: ::std::os::raw::c_uint) -> u32 {
        ({
             ({
                  ({
                       ({ 0 } |
                            ((permanent as u32 as u32) << 0usize) &
                                (1u64 as u32))
                   } |
                       ((markedEphemeral as u32 as u32) << 1usize) &
                           (2u64 as u32))
              } | ((neededInteger as u32 as u32) << 2usize) & (4u64 as u32))
         } | ((bucket as u32 as u32) << 3usize) & (4294967288u64 as u32))
    }
}
pub type CLIPSInteger = clipsInteger;

#[repr(C)]
#[derive(Debug, Copy)]
pub struct clipsBitMap {
    pub header: TypeHeader,
    pub next: *mut CLIPSBitMap,
    pub count: ::std::os::raw::c_long,
    pub _bitfield_1: u32,
    pub contents: *const ::std::os::raw::c_char,
    pub size: ::std::os::raw::c_ushort,
}
#[test]
fn bindgen_test_layout_clipsBitMap() {
    assert_eq!(::std::mem::size_of::<clipsBitMap>() , 48usize , concat ! (
               "Size of: " , stringify ! ( clipsBitMap ) ));
    assert_eq! (::std::mem::align_of::<clipsBitMap>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( clipsBitMap ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const clipsBitMap ) ) . header as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( clipsBitMap ) , "::" ,
                stringify ! ( header ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const clipsBitMap ) ) . next as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( clipsBitMap ) , "::" ,
                stringify ! ( next ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const clipsBitMap ) ) . count as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( clipsBitMap ) , "::" ,
                stringify ! ( count ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const clipsBitMap ) ) . contents as * const _
                as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( clipsBitMap ) , "::" ,
                stringify ! ( contents ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const clipsBitMap ) ) . size as * const _ as
                usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( clipsBitMap ) , "::" ,
                stringify ! ( size ) ));
}
impl Clone for clipsBitMap {
    fn clone(&self) -> Self { *self }
}
impl clipsBitMap {
    #[inline]
    pub fn permanent(&self) -> ::std::os::raw::c_uint {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 1u64 as u32;
        let val = (unit_field_val & mask) >> 0usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_permanent(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 1u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 0usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as
                                                *const u8,
                                            &mut self._bitfield_1 as *mut _ as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn markedEphemeral(&self) -> ::std::os::raw::c_uint {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 2u64 as u32;
        let val = (unit_field_val & mask) >> 1usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_markedEphemeral(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 2u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 1usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as
                                                *const u8,
                                            &mut self._bitfield_1 as *mut _ as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn neededBitMap(&self) -> ::std::os::raw::c_uint {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 4u64 as u32;
        let val = (unit_field_val & mask) >> 2usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_neededBitMap(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 4u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 2usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as
                                                *const u8,
                                            &mut self._bitfield_1 as *mut _ as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn bucket(&self) -> ::std::os::raw::c_uint {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 4294967288u64 as u32;
        let val = (unit_field_val & mask) >> 3usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_bucket(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 4294967288u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 3usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as
                                                *const u8,
                                            &mut self._bitfield_1 as *mut _ as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn new_bitfield_1(permanent: ::std::os::raw::c_uint,
                          markedEphemeral: ::std::os::raw::c_uint,
                          neededBitMap: ::std::os::raw::c_uint,
                          bucket: ::std::os::raw::c_uint) -> u32 {
        ({
             ({
                  ({
                       ({ 0 } |
                            ((permanent as u32 as u32) << 0usize) &
                                (1u64 as u32))
                   } |
                       ((markedEphemeral as u32 as u32) << 1usize) &
                           (2u64 as u32))
              } | ((neededBitMap as u32 as u32) << 2usize) & (4u64 as u32))
         } | ((bucket as u32 as u32) << 3usize) & (4294967288u64 as u32))
    }
}
pub type CLIPSBitMap = clipsBitMap;

#[repr(C)]
#[derive(Debug, Copy)]
pub struct clipsExternalAddress {
    pub header: TypeHeader,
    pub next: *mut CLIPSExternalAddress,
    pub count: ::std::os::raw::c_long,
    pub _bitfield_1: u32,
    pub contents: *mut ::std::os::raw::c_void,
    pub type_: ::std::os::raw::c_ushort,
}
#[test]
fn bindgen_test_layout_clipsExternalAddress() {
    assert_eq!(::std::mem::size_of::<clipsExternalAddress>() , 48usize ,
               concat ! ( "Size of: " , stringify ! ( clipsExternalAddress )
               ));
    assert_eq! (::std::mem::align_of::<clipsExternalAddress>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( clipsExternalAddress ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const clipsExternalAddress ) ) . header as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( clipsExternalAddress )
                , "::" , stringify ! ( header ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const clipsExternalAddress ) ) . next as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( clipsExternalAddress )
                , "::" , stringify ! ( next ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const clipsExternalAddress ) ) . count as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( clipsExternalAddress )
                , "::" , stringify ! ( count ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const clipsExternalAddress ) ) . contents as *
                const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( clipsExternalAddress )
                , "::" , stringify ! ( contents ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const clipsExternalAddress ) ) . type_ as *
                const _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( clipsExternalAddress )
                , "::" , stringify ! ( type_ ) ));
}
impl Clone for clipsExternalAddress {
    fn clone(&self) -> Self { *self }
}
impl clipsExternalAddress {
    #[inline]
    pub fn permanent(&self) -> ::std::os::raw::c_uint {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 1u64 as u32;
        let val = (unit_field_val & mask) >> 0usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_permanent(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 1u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 0usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as
                                                *const u8,
                                            &mut self._bitfield_1 as *mut _ as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn markedEphemeral(&self) -> ::std::os::raw::c_uint {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 2u64 as u32;
        let val = (unit_field_val & mask) >> 1usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_markedEphemeral(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 2u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 1usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as
                                                *const u8,
                                            &mut self._bitfield_1 as *mut _ as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn neededPointer(&self) -> ::std::os::raw::c_uint {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 4u64 as u32;
        let val = (unit_field_val & mask) >> 2usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_neededPointer(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 4u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 2usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as
                                                *const u8,
                                            &mut self._bitfield_1 as *mut _ as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn bucket(&self) -> ::std::os::raw::c_uint {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 4294967288u64 as u32;
        let val = (unit_field_val & mask) >> 3usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_bucket(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 4294967288u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 3usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as
                                                *const u8,
                                            &mut self._bitfield_1 as *mut _ as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn new_bitfield_1(permanent: ::std::os::raw::c_uint,
                          markedEphemeral: ::std::os::raw::c_uint,
                          neededPointer: ::std::os::raw::c_uint,
                          bucket: ::std::os::raw::c_uint) -> u32 {
        ({
             ({
                  ({
                       ({ 0 } |
                            ((permanent as u32 as u32) << 0usize) &
                                (1u64 as u32))
                   } |
                       ((markedEphemeral as u32 as u32) << 1usize) &
                           (2u64 as u32))
              } | ((neededPointer as u32 as u32) << 2usize) & (4u64 as u32))
         } | ((bucket as u32 as u32) << 3usize) & (4294967288u64 as u32))
    }
}
pub type CLIPSExternalAddress = clipsExternalAddress;

#[repr(C)]
#[derive(Debug, Copy)]
pub struct typeHeader {
    pub type_: ::std::os::raw::c_ushort,
}
#[test]
fn bindgen_test_layout_typeHeader() {
    assert_eq!(::std::mem::size_of::<typeHeader>() , 2usize , concat ! (
               "Size of: " , stringify ! ( typeHeader ) ));
    assert_eq! (::std::mem::align_of::<typeHeader>() , 2usize , concat ! (
                "Alignment of " , stringify ! ( typeHeader ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const typeHeader ) ) . type_ as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( typeHeader ) , "::" ,
                stringify ! ( type_ ) ));
}
impl Clone for typeHeader {
    fn clone(&self) -> Self { *self }
}
pub type TypeHeader = typeHeader;

#[repr(C)]
#[derive(Copy)]
pub struct multifield {
    pub header: TypeHeader,
    pub busyCount: ::std::os::raw::c_uint,
    pub length: usize,
    pub next: *mut Multifield,
    pub contents: [CLIPSValue; 1usize],
}
#[test]
fn bindgen_test_layout_multifield() {
    assert_eq!(::std::mem::size_of::<multifield>() , 32usize , concat ! (
               "Size of: " , stringify ! ( multifield ) ));
    assert_eq! (::std::mem::align_of::<multifield>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( multifield ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const multifield ) ) . header as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( multifield ) , "::" ,
                stringify ! ( header ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const multifield ) ) . busyCount as * const _
                as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( multifield ) , "::" ,
                stringify ! ( busyCount ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const multifield ) ) . length as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( multifield ) , "::" ,
                stringify ! ( length ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const multifield ) ) . next as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( multifield ) , "::" ,
                stringify ! ( next ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const multifield ) ) . contents as * const _ as
                usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( multifield ) , "::" ,
                stringify ! ( contents ) ));
}
impl Clone for multifield {
    fn clone(&self) -> Self { *self }
}
pub type Multifield = multifield;

#[repr(C)]
#[derive(Copy)]
pub struct clipsValue {
    pub __bindgen_anon_1: clipsValue__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy)]
pub union clipsValue__bindgen_ty_1 {
    pub value: *mut ::std::os::raw::c_void,
    pub header: *mut TypeHeader,
    pub lexemeValue: *mut CLIPSLexeme,
    pub floatValue: *mut CLIPSFloat,
    pub integerValue: *mut CLIPSInteger,
    pub voidValue: *mut CLIPSVoid,
    pub multifieldValue: *mut Multifield,
    pub factValue: *mut Fact,
    pub instanceValue: *mut Instance,
    pub externalAddressValue: *mut CLIPSExternalAddress,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_clipsValue__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<clipsValue__bindgen_ty_1>() , 8usize ,
               concat ! (
               "Size of: " , stringify ! ( clipsValue__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<clipsValue__bindgen_ty_1>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( clipsValue__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const clipsValue__bindgen_ty_1 ) ) . value as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                clipsValue__bindgen_ty_1 ) , "::" , stringify ! ( value ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const clipsValue__bindgen_ty_1 ) ) . header as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                clipsValue__bindgen_ty_1 ) , "::" , stringify ! ( header ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const clipsValue__bindgen_ty_1 ) ) .
                lexemeValue as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                clipsValue__bindgen_ty_1 ) , "::" , stringify ! ( lexemeValue
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const clipsValue__bindgen_ty_1 ) ) . floatValue
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                clipsValue__bindgen_ty_1 ) , "::" , stringify ! ( floatValue )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const clipsValue__bindgen_ty_1 ) ) .
                integerValue as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                clipsValue__bindgen_ty_1 ) , "::" , stringify ! ( integerValue
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const clipsValue__bindgen_ty_1 ) ) . voidValue
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                clipsValue__bindgen_ty_1 ) , "::" , stringify ! ( voidValue )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const clipsValue__bindgen_ty_1 ) ) .
                multifieldValue as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                clipsValue__bindgen_ty_1 ) , "::" , stringify ! (
                multifieldValue ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const clipsValue__bindgen_ty_1 ) ) . factValue
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                clipsValue__bindgen_ty_1 ) , "::" , stringify ! ( factValue )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const clipsValue__bindgen_ty_1 ) ) .
                instanceValue as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                clipsValue__bindgen_ty_1 ) , "::" , stringify ! (
                instanceValue ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const clipsValue__bindgen_ty_1 ) ) .
                externalAddressValue as * const _ as usize } , 0usize , concat
                ! (
                "Alignment of field: " , stringify ! (
                clipsValue__bindgen_ty_1 ) , "::" , stringify ! (
                externalAddressValue ) ));
}
impl Clone for clipsValue__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_clipsValue() {
    assert_eq!(::std::mem::size_of::<clipsValue>() , 8usize , concat ! (
               "Size of: " , stringify ! ( clipsValue ) ));
    assert_eq! (::std::mem::align_of::<clipsValue>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( clipsValue ) ));
}
impl Clone for clipsValue {
    fn clone(&self) -> Self { *self }
}
pub type CLIPSValue = clipsValue;

#[repr(C)]
#[derive(Copy)]
pub struct udfValue {
    pub supplementalInfo: *mut ::std::os::raw::c_void,
    pub __bindgen_anon_1: udfValue__bindgen_ty_1,
    pub begin: usize,
    pub range: usize,
    pub next: *mut udfValue,
}
#[repr(C)]
#[derive(Copy)]
pub union udfValue__bindgen_ty_1 {
    pub value: *mut ::std::os::raw::c_void,
    pub header: *mut TypeHeader,
    pub lexemeValue: *mut CLIPSLexeme,
    pub floatValue: *mut CLIPSFloat,
    pub integerValue: *mut CLIPSInteger,
    pub voidValue: *mut CLIPSVoid,
    pub multifieldValue: *mut Multifield,
    pub factValue: *mut Fact,
    pub instanceValue: *mut Instance,
    pub externalAddressValue: *mut CLIPSExternalAddress,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_udfValue__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<udfValue__bindgen_ty_1>() , 8usize ,
               concat ! ( "Size of: " , stringify ! ( udfValue__bindgen_ty_1 )
               ));
    assert_eq! (::std::mem::align_of::<udfValue__bindgen_ty_1>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( udfValue__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const udfValue__bindgen_ty_1 ) ) . value as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( udfValue__bindgen_ty_1
                ) , "::" , stringify ! ( value ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const udfValue__bindgen_ty_1 ) ) . header as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( udfValue__bindgen_ty_1
                ) , "::" , stringify ! ( header ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const udfValue__bindgen_ty_1 ) ) . lexemeValue
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( udfValue__bindgen_ty_1
                ) , "::" , stringify ! ( lexemeValue ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const udfValue__bindgen_ty_1 ) ) . floatValue
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( udfValue__bindgen_ty_1
                ) , "::" , stringify ! ( floatValue ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const udfValue__bindgen_ty_1 ) ) . integerValue
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( udfValue__bindgen_ty_1
                ) , "::" , stringify ! ( integerValue ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const udfValue__bindgen_ty_1 ) ) . voidValue as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( udfValue__bindgen_ty_1
                ) , "::" , stringify ! ( voidValue ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const udfValue__bindgen_ty_1 ) ) .
                multifieldValue as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( udfValue__bindgen_ty_1
                ) , "::" , stringify ! ( multifieldValue ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const udfValue__bindgen_ty_1 ) ) . factValue as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( udfValue__bindgen_ty_1
                ) , "::" , stringify ! ( factValue ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const udfValue__bindgen_ty_1 ) ) .
                instanceValue as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( udfValue__bindgen_ty_1
                ) , "::" , stringify ! ( instanceValue ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const udfValue__bindgen_ty_1 ) ) .
                externalAddressValue as * const _ as usize } , 0usize , concat
                ! (
                "Alignment of field: " , stringify ! ( udfValue__bindgen_ty_1
                ) , "::" , stringify ! ( externalAddressValue ) ));
}
impl Clone for udfValue__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_udfValue() {
    assert_eq!(::std::mem::size_of::<udfValue>() , 40usize , concat ! (
               "Size of: " , stringify ! ( udfValue ) ));
    assert_eq! (::std::mem::align_of::<udfValue>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( udfValue ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const udfValue ) ) . supplementalInfo as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( udfValue ) , "::" ,
                stringify ! ( supplementalInfo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const udfValue ) ) . begin as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( udfValue ) , "::" ,
                stringify ! ( begin ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const udfValue ) ) . range as * const _ as
                usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( udfValue ) , "::" ,
                stringify ! ( range ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const udfValue ) ) . next as * const _ as usize
                } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( udfValue ) , "::" ,
                stringify ! ( next ) ));
}
impl Clone for udfValue {
    fn clone(&self) -> Self { *self }
}
pub type UDFValue = udfValue;
#[repr(C)]
#[derive(Copy)]
pub struct fact {
    pub __bindgen_anon_1: fact__bindgen_ty_1,
    pub whichDeftemplate: *mut Deftemplate,
    pub list: *mut ::std::os::raw::c_void,
    pub factIndex: ::std::os::raw::c_longlong,
    pub hashValue: ::std::os::raw::c_ulong,
    pub _bitfield_1: u8,
    pub previousFact: *mut Fact,
    pub nextFact: *mut Fact,
    pub previousTemplateFact: *mut Fact,
    pub nextTemplateFact: *mut Fact,
    pub basisSlots: *mut Multifield,
    pub theProposition: Multifield,
}
#[repr(C)]
#[derive(Copy)]
pub union fact__bindgen_ty_1 {
    pub patternHeader: patternEntity,
    pub header: TypeHeader,
    _bindgen_union_align: [u64; 5usize],
}
#[test]
fn bindgen_test_layout_fact__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<fact__bindgen_ty_1>() , 40usize , concat
               ! ( "Size of: " , stringify ! ( fact__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<fact__bindgen_ty_1>() , 8usize , concat
                ! ( "Alignment of " , stringify ! ( fact__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const fact__bindgen_ty_1 ) ) . patternHeader as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( fact__bindgen_ty_1 ) ,
                "::" , stringify ! ( patternHeader ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const fact__bindgen_ty_1 ) ) . header as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( fact__bindgen_ty_1 ) ,
                "::" , stringify ! ( header ) ));
}
impl Clone for fact__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_fact() {
    assert_eq!(::std::mem::size_of::<fact>() , 152usize , concat ! (
               "Size of: " , stringify ! ( fact ) ));
    assert_eq! (::std::mem::align_of::<fact>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( fact ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const fact ) ) . whichDeftemplate as * const _
                as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( fact ) , "::" ,
                stringify ! ( whichDeftemplate ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const fact ) ) . list as * const _ as usize } ,
                48usize , concat ! (
                "Alignment of field: " , stringify ! ( fact ) , "::" ,
                stringify ! ( list ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const fact ) ) . factIndex as * const _ as
                usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( fact ) , "::" ,
                stringify ! ( factIndex ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const fact ) ) . hashValue as * const _ as
                usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( fact ) , "::" ,
                stringify ! ( hashValue ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const fact ) ) . previousFact as * const _ as
                usize } , 80usize , concat ! (
                "Alignment of field: " , stringify ! ( fact ) , "::" ,
                stringify ! ( previousFact ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const fact ) ) . nextFact as * const _ as usize
                } , 88usize , concat ! (
                "Alignment of field: " , stringify ! ( fact ) , "::" ,
                stringify ! ( nextFact ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const fact ) ) . previousTemplateFact as *
                const _ as usize } , 96usize , concat ! (
                "Alignment of field: " , stringify ! ( fact ) , "::" ,
                stringify ! ( previousTemplateFact ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const fact ) ) . nextTemplateFact as * const _
                as usize } , 104usize , concat ! (
                "Alignment of field: " , stringify ! ( fact ) , "::" ,
                stringify ! ( nextTemplateFact ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const fact ) ) . basisSlots as * const _ as
                usize } , 112usize , concat ! (
                "Alignment of field: " , stringify ! ( fact ) , "::" ,
                stringify ! ( basisSlots ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const fact ) ) . theProposition as * const _ as
                usize } , 120usize , concat ! (
                "Alignment of field: " , stringify ! ( fact ) , "::" ,
                stringify ! ( theProposition ) ));
}
impl Clone for fact {
    fn clone(&self) -> Self { *self }
}
impl fact {
    #[inline]
    pub fn garbage(&self) -> ::std::os::raw::c_uint {
        let mut unit_field_val: u8 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u8 as
                                                *mut u8,
                                            ::std::mem::size_of::<u8>())
        };
        let mask = 1u64 as u8;
        let val = (unit_field_val & mask) >> 0usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_garbage(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 1u64 as u8;
        let val = val as u32 as u8;
        let mut unit_field_val: u8 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u8 as
                                                *mut u8,
                                            ::std::mem::size_of::<u8>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 0usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as
                                                *const u8,
                                            &mut self._bitfield_1 as *mut _ as
                                                *mut u8,
                                            ::std::mem::size_of::<u8>());
        }
    }
    #[inline]
    pub fn new_bitfield_1(garbage: ::std::os::raw::c_uint) -> u8 {
        ({ 0 } | ((garbage as u32 as u8) << 0usize) & (1u64 as u8))
    }
}
pub type Fact = fact;
#[repr(C)]
#[derive(Copy)]
pub struct instance {
    pub __bindgen_anon_1: instance__bindgen_ty_1,
    pub partialMatchList: *mut ::std::os::raw::c_void,
    pub basisSlots: *mut InstanceSlot,
    pub _bitfield_1: u8,
    pub name: *mut CLIPSLexeme,
    pub hashTableIndex: ::std::os::raw::c_uint,
    pub busy: ::std::os::raw::c_uint,
    pub cls: *mut Defclass,
    pub prvClass: *mut Instance,
    pub nxtClass: *mut Instance,
    pub prvHash: *mut Instance,
    pub nxtHash: *mut Instance,
    pub prvList: *mut Instance,
    pub nxtList: *mut Instance,
    pub slotAddresses: *mut *mut InstanceSlot,
    pub slots: *mut InstanceSlot,
}
#[repr(C)]
#[derive(Copy)]
pub union instance__bindgen_ty_1 {
    pub patternHeader: patternEntity,
    pub header: TypeHeader,
    _bindgen_union_align: [u64; 5usize],
}
#[test]
fn bindgen_test_layout_instance__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<instance__bindgen_ty_1>() , 40usize ,
               concat ! ( "Size of: " , stringify ! ( instance__bindgen_ty_1 )
               ));
    assert_eq! (::std::mem::align_of::<instance__bindgen_ty_1>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( instance__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const instance__bindgen_ty_1 ) ) .
                patternHeader as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( instance__bindgen_ty_1
                ) , "::" , stringify ! ( patternHeader ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const instance__bindgen_ty_1 ) ) . header as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( instance__bindgen_ty_1
                ) , "::" , stringify ! ( header ) ));
}
impl Clone for instance__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_instance() {
    assert_eq!(::std::mem::size_of::<instance>() , 152usize , concat ! (
               "Size of: " , stringify ! ( instance ) ));
    assert_eq! (::std::mem::align_of::<instance>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( instance ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const instance ) ) . partialMatchList as *
                const _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( instance ) , "::" ,
                stringify ! ( partialMatchList ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const instance ) ) . basisSlots as * const _ as
                usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( instance ) , "::" ,
                stringify ! ( basisSlots ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const instance ) ) . name as * const _ as usize
                } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( instance ) , "::" ,
                stringify ! ( name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const instance ) ) . hashTableIndex as * const
                _ as usize } , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( instance ) , "::" ,
                stringify ! ( hashTableIndex ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const instance ) ) . busy as * const _ as usize
                } , 76usize , concat ! (
                "Alignment of field: " , stringify ! ( instance ) , "::" ,
                stringify ! ( busy ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const instance ) ) . cls as * const _ as usize
                } , 80usize , concat ! (
                "Alignment of field: " , stringify ! ( instance ) , "::" ,
                stringify ! ( cls ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const instance ) ) . prvClass as * const _ as
                usize } , 88usize , concat ! (
                "Alignment of field: " , stringify ! ( instance ) , "::" ,
                stringify ! ( prvClass ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const instance ) ) . nxtClass as * const _ as
                usize } , 96usize , concat ! (
                "Alignment of field: " , stringify ! ( instance ) , "::" ,
                stringify ! ( nxtClass ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const instance ) ) . prvHash as * const _ as
                usize } , 104usize , concat ! (
                "Alignment of field: " , stringify ! ( instance ) , "::" ,
                stringify ! ( prvHash ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const instance ) ) . nxtHash as * const _ as
                usize } , 112usize , concat ! (
                "Alignment of field: " , stringify ! ( instance ) , "::" ,
                stringify ! ( nxtHash ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const instance ) ) . prvList as * const _ as
                usize } , 120usize , concat ! (
                "Alignment of field: " , stringify ! ( instance ) , "::" ,
                stringify ! ( prvList ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const instance ) ) . nxtList as * const _ as
                usize } , 128usize , concat ! (
                "Alignment of field: " , stringify ! ( instance ) , "::" ,
                stringify ! ( nxtList ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const instance ) ) . slotAddresses as * const _
                as usize } , 136usize , concat ! (
                "Alignment of field: " , stringify ! ( instance ) , "::" ,
                stringify ! ( slotAddresses ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const instance ) ) . slots as * const _ as
                usize } , 144usize , concat ! (
                "Alignment of field: " , stringify ! ( instance ) , "::" ,
                stringify ! ( slots ) ));
}
impl Clone for instance {
    fn clone(&self) -> Self { *self }
}
impl instance {
    #[inline]
    pub fn installed(&self) -> ::std::os::raw::c_uint {
        let mut unit_field_val: u8 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u8 as
                                                *mut u8,
                                            ::std::mem::size_of::<u8>())
        };
        let mask = 1u64 as u8;
        let val = (unit_field_val & mask) >> 0usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_installed(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 1u64 as u8;
        let val = val as u32 as u8;
        let mut unit_field_val: u8 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u8 as
                                                *mut u8,
                                            ::std::mem::size_of::<u8>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 0usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as
                                                *const u8,
                                            &mut self._bitfield_1 as *mut _ as
                                                *mut u8,
                                            ::std::mem::size_of::<u8>());
        }
    }
    #[inline]
    pub fn garbage(&self) -> ::std::os::raw::c_uint {
        let mut unit_field_val: u8 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u8 as
                                                *mut u8,
                                            ::std::mem::size_of::<u8>())
        };
        let mask = 2u64 as u8;
        let val = (unit_field_val & mask) >> 1usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_garbage(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 2u64 as u8;
        let val = val as u32 as u8;
        let mut unit_field_val: u8 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u8 as
                                                *mut u8,
                                            ::std::mem::size_of::<u8>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 1usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as
                                                *const u8,
                                            &mut self._bitfield_1 as *mut _ as
                                                *mut u8,
                                            ::std::mem::size_of::<u8>());
        }
    }
    #[inline]
    pub fn initSlotsCalled(&self) -> ::std::os::raw::c_uint {
        let mut unit_field_val: u8 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u8 as
                                                *mut u8,
                                            ::std::mem::size_of::<u8>())
        };
        let mask = 4u64 as u8;
        let val = (unit_field_val & mask) >> 2usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_initSlotsCalled(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 4u64 as u8;
        let val = val as u32 as u8;
        let mut unit_field_val: u8 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u8 as
                                                *mut u8,
                                            ::std::mem::size_of::<u8>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 2usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as
                                                *const u8,
                                            &mut self._bitfield_1 as *mut _ as
                                                *mut u8,
                                            ::std::mem::size_of::<u8>());
        }
    }
    #[inline]
    pub fn initializeInProgress(&self) -> ::std::os::raw::c_uint {
        let mut unit_field_val: u8 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u8 as
                                                *mut u8,
                                            ::std::mem::size_of::<u8>())
        };
        let mask = 8u64 as u8;
        let val = (unit_field_val & mask) >> 3usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_initializeInProgress(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 8u64 as u8;
        let val = val as u32 as u8;
        let mut unit_field_val: u8 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u8 as
                                                *mut u8,
                                            ::std::mem::size_of::<u8>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 3usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as
                                                *const u8,
                                            &mut self._bitfield_1 as *mut _ as
                                                *mut u8,
                                            ::std::mem::size_of::<u8>());
        }
    }
    #[inline]
    pub fn reteSynchronized(&self) -> ::std::os::raw::c_uint {
        let mut unit_field_val: u8 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u8 as
                                                *mut u8,
                                            ::std::mem::size_of::<u8>())
        };
        let mask = 16u64 as u8;
        let val = (unit_field_val & mask) >> 4usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_reteSynchronized(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 16u64 as u8;
        let val = val as u32 as u8;
        let mut unit_field_val: u8 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u8 as
                                                *mut u8,
                                            ::std::mem::size_of::<u8>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 4usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as
                                                *const u8,
                                            &mut self._bitfield_1 as *mut _ as
                                                *mut u8,
                                            ::std::mem::size_of::<u8>());
        }
    }
    #[inline]
    pub fn new_bitfield_1(installed: ::std::os::raw::c_uint,
                          garbage: ::std::os::raw::c_uint,
                          initSlotsCalled: ::std::os::raw::c_uint,
                          initializeInProgress: ::std::os::raw::c_uint,
                          reteSynchronized: ::std::os::raw::c_uint) -> u8 {
        ({
             ({
                  ({
                       ({
                            ({ 0 } |
                                 ((installed as u32 as u8) << 0usize) &
                                     (1u64 as u8))
                        } | ((garbage as u32 as u8) << 1usize) & (2u64 as u8))
                   } |
                       ((initSlotsCalled as u32 as u8) << 2usize) &
                           (4u64 as u8))
              } |
                  ((initializeInProgress as u32 as u8) << 3usize) &
                      (8u64 as u8))
         } | ((reteSynchronized as u32 as u8) << 4usize) & (16u64 as u8))
    }
}
pub type Instance = instance;

#[repr(C)]
#[derive(Copy)]
pub struct expr {
    pub type_: ::std::os::raw::c_ushort,
    pub __bindgen_anon_1: expr__bindgen_ty_1,
    pub argList: *mut Expression,
    pub nextArg: *mut Expression,
}
#[repr(C)]
#[derive(Copy)]
pub union expr__bindgen_ty_1 {
    pub value: *mut ::std::os::raw::c_void,
    pub lexemeValue: *mut CLIPSLexeme,
    pub floatValue: *mut CLIPSFloat,
    pub integerValue: *mut CLIPSInteger,
    pub bitMapValue: *mut CLIPSBitMap,
    pub constructValue: *mut ConstructHeader,
    pub functionValue: *mut FunctionDefinition,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_expr__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<expr__bindgen_ty_1>() , 8usize , concat !
               ( "Size of: " , stringify ! ( expr__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<expr__bindgen_ty_1>() , 8usize , concat
                ! ( "Alignment of " , stringify ! ( expr__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const expr__bindgen_ty_1 ) ) . value as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( expr__bindgen_ty_1 ) ,
                "::" , stringify ! ( value ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const expr__bindgen_ty_1 ) ) . lexemeValue as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( expr__bindgen_ty_1 ) ,
                "::" , stringify ! ( lexemeValue ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const expr__bindgen_ty_1 ) ) . floatValue as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( expr__bindgen_ty_1 ) ,
                "::" , stringify ! ( floatValue ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const expr__bindgen_ty_1 ) ) . integerValue as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( expr__bindgen_ty_1 ) ,
                "::" , stringify ! ( integerValue ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const expr__bindgen_ty_1 ) ) . bitMapValue as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( expr__bindgen_ty_1 ) ,
                "::" , stringify ! ( bitMapValue ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const expr__bindgen_ty_1 ) ) . constructValue
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( expr__bindgen_ty_1 ) ,
                "::" , stringify ! ( constructValue ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const expr__bindgen_ty_1 ) ) . functionValue as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( expr__bindgen_ty_1 ) ,
                "::" , stringify ! ( functionValue ) ));
}
impl Clone for expr__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_expr() {
    assert_eq!(::std::mem::size_of::<expr>() , 32usize , concat ! (
               "Size of: " , stringify ! ( expr ) ));
    assert_eq! (::std::mem::align_of::<expr>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( expr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const expr ) ) . type_ as * const _ as usize }
                , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( expr ) , "::" ,
                stringify ! ( type_ ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const expr ) ) . argList as * const _ as usize
                } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( expr ) , "::" ,
                stringify ! ( argList ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const expr ) ) . nextArg as * const _ as usize
                } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( expr ) , "::" ,
                stringify ! ( nextArg ) ));
}
impl Clone for expr {
    fn clone(&self) -> Self { *self }
}
pub type Expression = expr;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct functionDefinition {
    pub callFunctionName: *mut CLIPSLexeme,
    pub actualFunctionName: *const ::std::os::raw::c_char,
    pub unknownReturnValueType: ::std::os::raw::c_uint,
    pub functionPointer: ::std::option::Option<unsafe extern "C" fn(arg1:
                                                                        *mut Environment,
                                                                    arg2:
                                                                        *mut UDFContext,
                                                                    arg3:
                                                                        *mut UDFValue)>,
    pub parser: ::std::option::Option<unsafe extern "C" fn(arg1:
                                                               *mut Environment,
                                                           arg2: *mut expr,
                                                           arg3:
                                                               *const ::std::os::raw::c_char)
                                          -> *mut expr>,
    pub restrictions: *mut CLIPSLexeme,
    pub minArgs: ::std::os::raw::c_ushort,
    pub maxArgs: ::std::os::raw::c_ushort,
    pub overloadable: bool,
    pub sequenceuseok: bool,
    pub neededFunction: bool,
    pub bsaveIndex: ::std::os::raw::c_ulong,
    pub next: *mut functionDefinition,
    pub usrData: *mut userData,
    pub context: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_functionDefinition() {
    assert_eq!(::std::mem::size_of::<functionDefinition>() , 88usize , concat
               ! ( "Size of: " , stringify ! ( functionDefinition ) ));
    assert_eq! (::std::mem::align_of::<functionDefinition>() , 8usize , concat
                ! ( "Alignment of " , stringify ! ( functionDefinition ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const functionDefinition ) ) . callFunctionName
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( functionDefinition ) ,
                "::" , stringify ! ( callFunctionName ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const functionDefinition ) ) .
                actualFunctionName as * const _ as usize } , 8usize , concat !
                (
                "Alignment of field: " , stringify ! ( functionDefinition ) ,
                "::" , stringify ! ( actualFunctionName ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const functionDefinition ) ) .
                unknownReturnValueType as * const _ as usize } , 16usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( functionDefinition ) ,
                "::" , stringify ! ( unknownReturnValueType ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const functionDefinition ) ) . functionPointer
                as * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( functionDefinition ) ,
                "::" , stringify ! ( functionPointer ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const functionDefinition ) ) . parser as *
                const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( functionDefinition ) ,
                "::" , stringify ! ( parser ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const functionDefinition ) ) . restrictions as
                * const _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( functionDefinition ) ,
                "::" , stringify ! ( restrictions ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const functionDefinition ) ) . minArgs as *
                const _ as usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( functionDefinition ) ,
                "::" , stringify ! ( minArgs ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const functionDefinition ) ) . maxArgs as *
                const _ as usize } , 50usize , concat ! (
                "Alignment of field: " , stringify ! ( functionDefinition ) ,
                "::" , stringify ! ( maxArgs ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const functionDefinition ) ) . overloadable as
                * const _ as usize } , 52usize , concat ! (
                "Alignment of field: " , stringify ! ( functionDefinition ) ,
                "::" , stringify ! ( overloadable ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const functionDefinition ) ) . sequenceuseok as
                * const _ as usize } , 53usize , concat ! (
                "Alignment of field: " , stringify ! ( functionDefinition ) ,
                "::" , stringify ! ( sequenceuseok ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const functionDefinition ) ) . neededFunction
                as * const _ as usize } , 54usize , concat ! (
                "Alignment of field: " , stringify ! ( functionDefinition ) ,
                "::" , stringify ! ( neededFunction ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const functionDefinition ) ) . bsaveIndex as *
                const _ as usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( functionDefinition ) ,
                "::" , stringify ! ( bsaveIndex ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const functionDefinition ) ) . next as * const
                _ as usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( functionDefinition ) ,
                "::" , stringify ! ( next ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const functionDefinition ) ) . usrData as *
                const _ as usize } , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( functionDefinition ) ,
                "::" , stringify ! ( usrData ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const functionDefinition ) ) . context as *
                const _ as usize } , 80usize , concat ! (
                "Alignment of field: " , stringify ! ( functionDefinition ) ,
                "::" , stringify ! ( context ) ));
}
impl Clone for functionDefinition {
    fn clone(&self) -> Self { *self }
}
pub type FunctionDefinition = functionDefinition;

#[repr(C)]
#[derive(Debug, Copy)]
pub struct udfContext {
    pub environment: *mut Environment,
    pub context: *mut ::std::os::raw::c_void,
    pub theFunction: *mut FunctionDefinition,
    pub lastPosition: ::std::os::raw::c_uint,
    pub lastArg: *mut Expression,
    pub returnValue: *mut UDFValue,
}
#[test]
fn bindgen_test_layout_udfContext() {
    assert_eq!(::std::mem::size_of::<udfContext>() , 48usize , concat ! (
               "Size of: " , stringify ! ( udfContext ) ));
    assert_eq! (::std::mem::align_of::<udfContext>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( udfContext ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const udfContext ) ) . environment as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( udfContext ) , "::" ,
                stringify ! ( environment ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const udfContext ) ) . context as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( udfContext ) , "::" ,
                stringify ! ( context ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const udfContext ) ) . theFunction as * const _
                as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( udfContext ) , "::" ,
                stringify ! ( theFunction ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const udfContext ) ) . lastPosition as * const
                _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( udfContext ) , "::" ,
                stringify ! ( lastPosition ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const udfContext ) ) . lastArg as * const _ as
                usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( udfContext ) , "::" ,
                stringify ! ( lastArg ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const udfContext ) ) . returnValue as * const _
                as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( udfContext ) , "::" ,
                stringify ! ( returnValue ) ));
}
impl Clone for udfContext {
    fn clone(&self) -> Self { *self }
}
pub type UDFContext = udfContext;

#[repr(C)]
#[derive(Debug, Copy)]
pub struct entityRecord {
    pub name: *const ::std::os::raw::c_char,
    pub _bitfield_1: u16,
    pub shortPrintFunction: EntityPrintFunction,
    pub longPrintFunction: EntityPrintFunction,
    pub deleteFunction: ::std::option::Option<unsafe extern "C" fn(arg1:
                                                                       *mut ::std::os::raw::c_void,
                                                                   arg2:
                                                                       *mut Environment)
                                                  -> bool>,
    pub evaluateFunction: EntityEvaluationFunction,
    pub getNextFunction: ::std::option::Option<unsafe extern "C" fn(arg1:
                                                                        *mut ::std::os::raw::c_void,
                                                                    arg2:
                                                                        *mut ::std::os::raw::c_void)
                                                   ->
                                                       *mut ::std::os::raw::c_void>,
    pub decrementBusyCount: EntityBusyCountFunction,
    pub incrementBusyCount: EntityBusyCountFunction,
    pub propagateDepth: ::std::option::Option<unsafe extern "C" fn(arg1:
                                                                       *mut ::std::os::raw::c_void,
                                                                   arg2:
                                                                       *mut ::std::os::raw::c_void)>,
    pub markNeeded: ::std::option::Option<unsafe extern "C" fn(arg1:
                                                                   *mut ::std::os::raw::c_void,
                                                               arg2:
                                                                   *mut ::std::os::raw::c_void)>,
    pub install: ::std::option::Option<unsafe extern "C" fn(arg1:
                                                                *mut ::std::os::raw::c_void,
                                                            arg2:
                                                                *mut ::std::os::raw::c_void)>,
    pub deinstall: ::std::option::Option<unsafe extern "C" fn(arg1:
                                                                  *mut ::std::os::raw::c_void,
                                                              arg2:
                                                                  *mut ::std::os::raw::c_void)>,
    pub usrData: *mut userData,
}
#[test]
fn bindgen_test_layout_entityRecord() {
    assert_eq!(::std::mem::size_of::<entityRecord>() , 112usize , concat ! (
               "Size of: " , stringify ! ( entityRecord ) ));
    assert_eq! (::std::mem::align_of::<entityRecord>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( entityRecord ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const entityRecord ) ) . name as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( entityRecord ) , "::" ,
                stringify ! ( name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const entityRecord ) ) . shortPrintFunction as
                * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( entityRecord ) , "::" ,
                stringify ! ( shortPrintFunction ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const entityRecord ) ) . longPrintFunction as *
                const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( entityRecord ) , "::" ,
                stringify ! ( longPrintFunction ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const entityRecord ) ) . deleteFunction as *
                const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( entityRecord ) , "::" ,
                stringify ! ( deleteFunction ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const entityRecord ) ) . evaluateFunction as *
                const _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( entityRecord ) , "::" ,
                stringify ! ( evaluateFunction ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const entityRecord ) ) . getNextFunction as *
                const _ as usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( entityRecord ) , "::" ,
                stringify ! ( getNextFunction ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const entityRecord ) ) . decrementBusyCount as
                * const _ as usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( entityRecord ) , "::" ,
                stringify ! ( decrementBusyCount ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const entityRecord ) ) . incrementBusyCount as
                * const _ as usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( entityRecord ) , "::" ,
                stringify ! ( incrementBusyCount ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const entityRecord ) ) . propagateDepth as *
                const _ as usize } , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( entityRecord ) , "::" ,
                stringify ! ( propagateDepth ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const entityRecord ) ) . markNeeded as * const
                _ as usize } , 80usize , concat ! (
                "Alignment of field: " , stringify ! ( entityRecord ) , "::" ,
                stringify ! ( markNeeded ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const entityRecord ) ) . install as * const _
                as usize } , 88usize , concat ! (
                "Alignment of field: " , stringify ! ( entityRecord ) , "::" ,
                stringify ! ( install ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const entityRecord ) ) . deinstall as * const _
                as usize } , 96usize , concat ! (
                "Alignment of field: " , stringify ! ( entityRecord ) , "::" ,
                stringify ! ( deinstall ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const entityRecord ) ) . usrData as * const _
                as usize } , 104usize , concat ! (
                "Alignment of field: " , stringify ! ( entityRecord ) , "::" ,
                stringify ! ( usrData ) ));
}
impl Clone for entityRecord {
    fn clone(&self) -> Self { *self }
}
impl entityRecord {
    #[inline]
    pub fn type_(&self) -> ::std::os::raw::c_uint {
        let mut unit_field_val: u16 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u16 as
                                                *mut u8,
                                            ::std::mem::size_of::<u16>())
        };
        let mask = 8191u64 as u16;
        let val = (unit_field_val & mask) >> 0usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_type(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 8191u64 as u16;
        let val = val as u32 as u16;
        let mut unit_field_val: u16 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u16 as
                                                *mut u8,
                                            ::std::mem::size_of::<u16>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 0usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as
                                                *const u8,
                                            &mut self._bitfield_1 as *mut _ as
                                                *mut u8,
                                            ::std::mem::size_of::<u16>());
        }
    }
    #[inline]
    pub fn copyToEvaluate(&self) -> ::std::os::raw::c_uint {
        let mut unit_field_val: u16 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u16 as
                                                *mut u8,
                                            ::std::mem::size_of::<u16>())
        };
        let mask = 8192u64 as u16;
        let val = (unit_field_val & mask) >> 13usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_copyToEvaluate(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 8192u64 as u16;
        let val = val as u32 as u16;
        let mut unit_field_val: u16 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u16 as
                                                *mut u8,
                                            ::std::mem::size_of::<u16>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 13usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as
                                                *const u8,
                                            &mut self._bitfield_1 as *mut _ as
                                                *mut u8,
                                            ::std::mem::size_of::<u16>());
        }
    }
    #[inline]
    pub fn bitMap(&self) -> ::std::os::raw::c_uint {
        let mut unit_field_val: u16 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u16 as
                                                *mut u8,
                                            ::std::mem::size_of::<u16>())
        };
        let mask = 16384u64 as u16;
        let val = (unit_field_val & mask) >> 14usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_bitMap(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 16384u64 as u16;
        let val = val as u32 as u16;
        let mut unit_field_val: u16 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u16 as
                                                *mut u8,
                                            ::std::mem::size_of::<u16>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 14usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as
                                                *const u8,
                                            &mut self._bitfield_1 as *mut _ as
                                                *mut u8,
                                            ::std::mem::size_of::<u16>());
        }
    }
    #[inline]
    pub fn addsToRuleComplexity(&self) -> ::std::os::raw::c_uint {
        let mut unit_field_val: u16 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u16 as
                                                *mut u8,
                                            ::std::mem::size_of::<u16>())
        };
        let mask = 32768u64 as u16;
        let val = (unit_field_val & mask) >> 15usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_addsToRuleComplexity(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 32768u64 as u16;
        let val = val as u32 as u16;
        let mut unit_field_val: u16 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u16 as
                                                *mut u8,
                                            ::std::mem::size_of::<u16>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 15usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as
                                                *const u8,
                                            &mut self._bitfield_1 as *mut _ as
                                                *mut u8,
                                            ::std::mem::size_of::<u16>());
        }
    }
    #[inline]
    pub fn new_bitfield_1(type_: ::std::os::raw::c_uint,
                          copyToEvaluate: ::std::os::raw::c_uint,
                          bitMap: ::std::os::raw::c_uint,
                          addsToRuleComplexity: ::std::os::raw::c_uint)
     -> u16 {
        ({
             ({
                  ({
                       ({ 0 } |
                            ((type_ as u32 as u16) << 0usize) &
                                (8191u64 as u16))
                   } |
                       ((copyToEvaluate as u32 as u16) << 13usize) &
                           (8192u64 as u16))
              } | ((bitMap as u32 as u16) << 14usize) & (16384u64 as u16))
         } |
             ((addsToRuleComplexity as u32 as u16) << 15usize) &
                 (32768u64 as u16))
    }
}
pub type EntityRecord = entityRecord;
pub type EntityPrintFunction =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut Environment,
                                               arg2:
                                                   *const ::std::os::raw::c_char,
                                               arg3:
                                                   *mut ::std::os::raw::c_void)>;
pub type EntityEvaluationFunction =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut Environment,
                                               arg2:
                                                   *mut ::std::os::raw::c_void,
                                               arg3: *mut UDFValue) -> bool>;
pub type EntityBusyCountFunction =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut Environment,
                                               arg2:
                                                   *mut ::std::os::raw::c_void)>;

#[repr(C)]
#[derive(Debug, Copy)]
pub struct patternEntityRecord {
    pub base: entityRecord,
    pub decrementBasisCount: ::std::option::Option<unsafe extern "C" fn(arg1:
                                                                            *mut Environment,
                                                                        arg2:
                                                                            *mut ::std::os::raw::c_void)>,
    pub incrementBasisCount: ::std::option::Option<unsafe extern "C" fn(arg1:
                                                                            *mut Environment,
                                                                        arg2:
                                                                            *mut ::std::os::raw::c_void)>,
    pub matchFunction: ::std::option::Option<unsafe extern "C" fn(arg1:
                                                                      *mut Environment,
                                                                  arg2:
                                                                      *mut ::std::os::raw::c_void)>,
    pub synchronized: ::std::option::Option<unsafe extern "C" fn(arg1:
                                                                     *mut Environment,
                                                                 arg2:
                                                                     *mut ::std::os::raw::c_void)
                                                -> bool>,
    pub isDeleted: ::std::option::Option<unsafe extern "C" fn(arg1:
                                                                  *mut Environment,
                                                              arg2:
                                                                  *mut ::std::os::raw::c_void)
                                             -> bool>,
}
#[test]
fn bindgen_test_layout_patternEntityRecord() {
    assert_eq!(::std::mem::size_of::<patternEntityRecord>() , 152usize ,
               concat ! ( "Size of: " , stringify ! ( patternEntityRecord )
               ));
    assert_eq! (::std::mem::align_of::<patternEntityRecord>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( patternEntityRecord ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const patternEntityRecord ) ) . base as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( patternEntityRecord ) ,
                "::" , stringify ! ( base ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const patternEntityRecord ) ) .
                decrementBasisCount as * const _ as usize } , 112usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( patternEntityRecord ) ,
                "::" , stringify ! ( decrementBasisCount ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const patternEntityRecord ) ) .
                incrementBasisCount as * const _ as usize } , 120usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( patternEntityRecord ) ,
                "::" , stringify ! ( incrementBasisCount ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const patternEntityRecord ) ) . matchFunction
                as * const _ as usize } , 128usize , concat ! (
                "Alignment of field: " , stringify ! ( patternEntityRecord ) ,
                "::" , stringify ! ( matchFunction ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const patternEntityRecord ) ) . synchronized as
                * const _ as usize } , 136usize , concat ! (
                "Alignment of field: " , stringify ! ( patternEntityRecord ) ,
                "::" , stringify ! ( synchronized ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const patternEntityRecord ) ) . isDeleted as *
                const _ as usize } , 144usize , concat ! (
                "Alignment of field: " , stringify ! ( patternEntityRecord ) ,
                "::" , stringify ! ( isDeleted ) ));
}
impl Clone for patternEntityRecord {
    fn clone(&self) -> Self { *self }
}
pub type PatternEntityRecord = patternEntityRecord;

#[repr(C)]
#[derive(Debug, Copy)]
pub struct patternEntity {
    pub header: TypeHeader,
    pub theInfo: *mut patternEntityRecord,
    pub dependents: *mut ::std::os::raw::c_void,
    pub busyCount: ::std::os::raw::c_uint,
    pub timeTag: ::std::os::raw::c_ulonglong,
}
#[test]
fn bindgen_test_layout_patternEntity() {
    assert_eq!(::std::mem::size_of::<patternEntity>() , 40usize , concat ! (
               "Size of: " , stringify ! ( patternEntity ) ));
    assert_eq! (::std::mem::align_of::<patternEntity>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( patternEntity ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const patternEntity ) ) . header as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( patternEntity ) , "::"
                , stringify ! ( header ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const patternEntity ) ) . theInfo as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( patternEntity ) , "::"
                , stringify ! ( theInfo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const patternEntity ) ) . dependents as * const
                _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( patternEntity ) , "::"
                , stringify ! ( dependents ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const patternEntity ) ) . busyCount as * const
                _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( patternEntity ) , "::"
                , stringify ! ( busyCount ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const patternEntity ) ) . timeTag as * const _
                as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( patternEntity ) , "::"
                , stringify ! ( timeTag ) ));
}
impl Clone for patternEntity {
    fn clone(&self) -> Self { *self }
}
pub type PatternEntity = patternEntity;
pub type BoolCallFunction =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut Environment,
                                               arg2:
                                                   *mut ::std::os::raw::c_void)
                              -> bool>;
pub type VoidCallFunction =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut Environment,
                                               arg2:
                                                   *mut ::std::os::raw::c_void)>;
pub type VoidCallFunctionWithArg =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut Environment,
                                               arg2:
                                                   *mut ::std::os::raw::c_void,
                                               arg3:
                                                   *mut ::std::os::raw::c_void)>;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct environmentCleanupFunction {
    pub name: *const ::std::os::raw::c_char,
    pub func: ::std::option::Option<unsafe extern "C" fn(arg1:
                                                             *mut Environment)>,
    pub priority: ::std::os::raw::c_int,
    pub next: *mut environmentCleanupFunction,
}
#[test]
fn bindgen_test_layout_environmentCleanupFunction() {
    assert_eq!(::std::mem::size_of::<environmentCleanupFunction>() , 32usize ,
               concat ! (
               "Size of: " , stringify ! ( environmentCleanupFunction ) ));
    assert_eq! (::std::mem::align_of::<environmentCleanupFunction>() , 8usize
                , concat ! (
                "Alignment of " , stringify ! ( environmentCleanupFunction )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const environmentCleanupFunction ) ) . name as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                environmentCleanupFunction ) , "::" , stringify ! ( name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const environmentCleanupFunction ) ) . func as
                * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                environmentCleanupFunction ) , "::" , stringify ! ( func ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const environmentCleanupFunction ) ) . priority
                as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                environmentCleanupFunction ) , "::" , stringify ! ( priority )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const environmentCleanupFunction ) ) . next as
                * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! (
                environmentCleanupFunction ) , "::" , stringify ! ( next ) ));
}
impl Clone for environmentCleanupFunction {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    pub fn AllocateEnvironmentData(arg1: *mut Environment,
                                   arg2: ::std::os::raw::c_uint, arg3: usize,
                                   arg4: EnvironmentCleanupFunction) -> bool;
}
extern "C" {
    pub fn AddEnvironmentCleanupFunction(arg1: *mut Environment,
                                         arg2: *const ::std::os::raw::c_char,
                                         arg3: EnvironmentCleanupFunction,
                                         arg4: ::std::os::raw::c_int) -> bool;
}
extern "C" {
    pub fn GetEnvironmentContext(arg1: *mut Environment)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn SetEnvironmentContext(arg1: *mut Environment,
                                 arg2: *mut ::std::os::raw::c_void)
     -> *mut ::std::os::raw::c_void;
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct exprHashNode {
    pub hashval: ::std::os::raw::c_uint,
    pub count: ::std::os::raw::c_uint,
    pub exp: *mut Expression,
    pub next: *mut exprHashNode,
    pub bsaveID: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout_exprHashNode() {
    assert_eq!(::std::mem::size_of::<exprHashNode>() , 32usize , concat ! (
               "Size of: " , stringify ! ( exprHashNode ) ));
    assert_eq! (::std::mem::align_of::<exprHashNode>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( exprHashNode ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const exprHashNode ) ) . hashval as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( exprHashNode ) , "::" ,
                stringify ! ( hashval ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const exprHashNode ) ) . count as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( exprHashNode ) , "::" ,
                stringify ! ( count ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const exprHashNode ) ) . exp as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( exprHashNode ) , "::" ,
                stringify ! ( exp ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const exprHashNode ) ) . next as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( exprHashNode ) , "::" ,
                stringify ! ( next ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const exprHashNode ) ) . bsaveID as * const _
                as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( exprHashNode ) , "::" ,
                stringify ! ( bsaveID ) ));
}
impl Clone for exprHashNode {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct savedContexts {
    pub rtn: bool,
    pub brk: bool,
    pub nxt: *mut savedContexts,
}
#[test]
fn bindgen_test_layout_savedContexts() {
    assert_eq!(::std::mem::size_of::<savedContexts>() , 16usize , concat ! (
               "Size of: " , stringify ! ( savedContexts ) ));
    assert_eq! (::std::mem::align_of::<savedContexts>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( savedContexts ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const savedContexts ) ) . rtn as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( savedContexts ) , "::"
                , stringify ! ( rtn ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const savedContexts ) ) . brk as * const _ as
                usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! ( savedContexts ) , "::"
                , stringify ! ( brk ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const savedContexts ) ) . nxt as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( savedContexts ) , "::"
                , stringify ! ( nxt ) ));
}
impl Clone for savedContexts {
    fn clone(&self) -> Self { *self }
}
pub type SavedContexts = savedContexts;
extern "C" {
    pub fn ConstantExpression(arg1: *mut expr) -> bool;
}
extern "C" {
    pub fn PrintExpression(arg1: *mut Environment,
                           arg2: *const ::std::os::raw::c_char,
                           arg3: *mut expr);
}
extern "C" {
    pub fn ExpressionSize(arg1: *mut expr) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn CountArguments(arg1: *mut expr) -> ::std::os::raw::c_ushort;
}
extern "C" {
    pub fn CopyExpression(arg1: *mut Environment, arg2: *mut expr)
     -> *mut expr;
}
extern "C" {
    pub fn ExpressionContainsVariables(arg1: *mut expr, arg2: bool) -> bool;
}
extern "C" {
    pub fn IdenticalExpression(arg1: *mut expr, arg2: *mut expr) -> bool;
}
extern "C" {
    pub fn GenConstant(arg1: *mut Environment, arg2: ::std::os::raw::c_ushort,
                       arg3: *mut ::std::os::raw::c_void) -> *mut expr;
}
extern "C" {
    pub fn CheckArgumentAgainstRestriction(arg1: *mut Environment,
                                           arg2: *mut expr,
                                           arg3: ::std::os::raw::c_uint)
     -> bool;
}
extern "C" {
    pub fn ConstantType(arg1: ::std::os::raw::c_int) -> bool;
}
extern "C" {
    pub fn CombineExpressions(arg1: *mut Environment, arg2: *mut expr,
                              arg3: *mut expr) -> *mut expr;
}
extern "C" {
    pub fn AppendExpressions(arg1: *mut expr, arg2: *mut expr) -> *mut expr;
}
extern "C" {
    pub fn NegateExpression(arg1: *mut Environment, arg2: *mut expr)
     -> *mut expr;
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct construct {
    pub constructName: *const ::std::os::raw::c_char,
    pub pluralName: *const ::std::os::raw::c_char,
    pub parseFunction: ::std::option::Option<unsafe extern "C" fn(arg1:
                                                                      *mut Environment,
                                                                  arg2:
                                                                      *const ::std::os::raw::c_char)
                                                 -> bool>,
    pub findFunction: FindConstructFunction,
    pub getConstructNameFunction: ::std::option::Option<unsafe extern "C" fn(arg1:
                                                                                 *mut ConstructHeader)
                                                            ->
                                                                *mut CLIPSLexeme>,
    pub getPPFormFunction: ::std::option::Option<unsafe extern "C" fn(arg1:
                                                                          *mut ConstructHeader)
                                                     ->
                                                         *const ::std::os::raw::c_char>,
    pub getModuleItemFunction: ::std::option::Option<unsafe extern "C" fn(arg1:
                                                                              *mut ConstructHeader)
                                                         ->
                                                             *mut defmoduleItemHeader>,
    pub getNextItemFunction: GetNextConstructFunction,
    pub setNextItemFunction: ::std::option::Option<unsafe extern "C" fn(arg1:
                                                                            *mut ConstructHeader,
                                                                        arg2:
                                                                            *mut ConstructHeader)>,
    pub isConstructDeletableFunction: IsConstructDeletableFunction,
    pub deleteFunction: DeleteConstructFunction,
    pub freeFunction: FreeConstructFunction,
    pub next: *mut Construct,
}
#[test]
fn bindgen_test_layout_construct() {
    assert_eq!(::std::mem::size_of::<construct>() , 104usize , concat ! (
               "Size of: " , stringify ! ( construct ) ));
    assert_eq! (::std::mem::align_of::<construct>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( construct ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const construct ) ) . constructName as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( construct ) , "::" ,
                stringify ! ( constructName ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const construct ) ) . pluralName as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( construct ) , "::" ,
                stringify ! ( pluralName ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const construct ) ) . parseFunction as * const
                _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( construct ) , "::" ,
                stringify ! ( parseFunction ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const construct ) ) . findFunction as * const _
                as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( construct ) , "::" ,
                stringify ! ( findFunction ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const construct ) ) . getConstructNameFunction
                as * const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( construct ) , "::" ,
                stringify ! ( getConstructNameFunction ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const construct ) ) . getPPFormFunction as *
                const _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( construct ) , "::" ,
                stringify ! ( getPPFormFunction ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const construct ) ) . getModuleItemFunction as
                * const _ as usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( construct ) , "::" ,
                stringify ! ( getModuleItemFunction ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const construct ) ) . getNextItemFunction as *
                const _ as usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( construct ) , "::" ,
                stringify ! ( getNextItemFunction ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const construct ) ) . setNextItemFunction as *
                const _ as usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( construct ) , "::" ,
                stringify ! ( setNextItemFunction ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const construct ) ) .
                isConstructDeletableFunction as * const _ as usize } , 72usize
                , concat ! (
                "Alignment of field: " , stringify ! ( construct ) , "::" ,
                stringify ! ( isConstructDeletableFunction ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const construct ) ) . deleteFunction as * const
                _ as usize } , 80usize , concat ! (
                "Alignment of field: " , stringify ! ( construct ) , "::" ,
                stringify ! ( deleteFunction ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const construct ) ) . freeFunction as * const _
                as usize } , 88usize , concat ! (
                "Alignment of field: " , stringify ! ( construct ) , "::" ,
                stringify ! ( freeFunction ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const construct ) ) . next as * const _ as
                usize } , 96usize , concat ! (
                "Alignment of field: " , stringify ! ( construct ) , "::" ,
                stringify ! ( next ) ));
}
impl Clone for construct {
    fn clone(&self) -> Self { *self }
}
pub type Construct = construct;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct userData {
    pub dataID: ::std::os::raw::c_uchar,
    pub next: *mut userData,
}
#[test]
fn bindgen_test_layout_userData() {
    assert_eq!(::std::mem::size_of::<userData>() , 16usize , concat ! (
               "Size of: " , stringify ! ( userData ) ));
    assert_eq! (::std::mem::align_of::<userData>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( userData ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const userData ) ) . dataID as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( userData ) , "::" ,
                stringify ! ( dataID ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const userData ) ) . next as * const _ as usize
                } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( userData ) , "::" ,
                stringify ! ( next ) ));
}
impl Clone for userData {
    fn clone(&self) -> Self { *self }
}
pub type USER_DATA = userData;
pub type USER_DATA_PTR = *mut userData;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct userDataRecord {
    pub dataID: ::std::os::raw::c_uchar,
    pub createUserData: ::std::option::Option<unsafe extern "C" fn(arg1:
                                                                       *mut Environment)
                                                  ->
                                                      *mut ::std::os::raw::c_void>,
    pub deleteUserData: ::std::option::Option<unsafe extern "C" fn(arg1:
                                                                       *mut Environment,
                                                                   arg2:
                                                                       *mut ::std::os::raw::c_void)>,
}
#[test]
fn bindgen_test_layout_userDataRecord() {
    assert_eq!(::std::mem::size_of::<userDataRecord>() , 24usize , concat ! (
               "Size of: " , stringify ! ( userDataRecord ) ));
    assert_eq! (::std::mem::align_of::<userDataRecord>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( userDataRecord ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const userDataRecord ) ) . dataID as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( userDataRecord ) , "::"
                , stringify ! ( dataID ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const userDataRecord ) ) . createUserData as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( userDataRecord ) , "::"
                , stringify ! ( createUserData ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const userDataRecord ) ) . deleteUserData as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( userDataRecord ) , "::"
                , stringify ! ( deleteUserData ) ));
}
impl Clone for userDataRecord {
    fn clone(&self) -> Self { *self }
}
pub type USER_DATA_RECORD = userDataRecord;
pub type USER_DATA_RECORD_PTR = *mut userDataRecord;
#[repr(C)]
#[derive(Copy)]
pub struct userDataData {
    pub UserDataRecordArray: [*mut userDataRecord; 100usize],
    pub UserDataRecordCount: ::std::os::raw::c_uchar,
}
#[test]
fn bindgen_test_layout_userDataData() {
    assert_eq!(::std::mem::size_of::<userDataData>() , 808usize , concat ! (
               "Size of: " , stringify ! ( userDataData ) ));
    assert_eq! (::std::mem::align_of::<userDataData>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( userDataData ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const userDataData ) ) . UserDataRecordArray as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( userDataData ) , "::" ,
                stringify ! ( UserDataRecordArray ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const userDataData ) ) . UserDataRecordCount as
                * const _ as usize } , 800usize , concat ! (
                "Alignment of field: " , stringify ! ( userDataData ) , "::" ,
                stringify ! ( UserDataRecordCount ) ));
}
impl Clone for userDataData {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    pub fn InitializeUserDataData(arg1: *mut Environment);
}
extern "C" {
    pub fn InstallUserDataRecord(arg1: *mut Environment,
                                 arg2: *mut userDataRecord)
     -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn FetchUserData(arg1: *mut Environment,
                         arg2: ::std::os::raw::c_uchar,
                         arg3: *mut *mut userData) -> *mut userData;
}
extern "C" {
    pub fn TestUserData(arg1: ::std::os::raw::c_uchar, arg2: *mut userData)
     -> *mut userData;
}
extern "C" {
    pub fn ClearUserDataList(arg1: *mut Environment, arg2: *mut userData);
}
extern "C" {
    pub fn DeleteUserData(arg1: *mut Environment,
                          arg2: ::std::os::raw::c_uchar, arg3: *mut userData)
     -> *mut userData;
}

#[repr(C)]
#[derive(Debug, Copy)]
pub struct defmodule {
    pub header: ConstructHeader,
    pub itemsArray: *mut *mut DefmoduleItemHeader,
    pub importList: *mut PortItem,
    pub exportList: *mut PortItem,
    pub visitedFlag: bool,
}
#[test]
fn bindgen_test_layout_defmodule() {
    assert_eq!(::std::mem::size_of::<defmodule>() , 96usize , concat ! (
               "Size of: " , stringify ! ( defmodule ) ));
    assert_eq! (::std::mem::align_of::<defmodule>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( defmodule ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const defmodule ) ) . header as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( defmodule ) , "::" ,
                stringify ! ( header ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const defmodule ) ) . itemsArray as * const _
                as usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( defmodule ) , "::" ,
                stringify ! ( itemsArray ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const defmodule ) ) . importList as * const _
                as usize } , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( defmodule ) , "::" ,
                stringify ! ( importList ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const defmodule ) ) . exportList as * const _
                as usize } , 80usize , concat ! (
                "Alignment of field: " , stringify ! ( defmodule ) , "::" ,
                stringify ! ( exportList ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const defmodule ) ) . visitedFlag as * const _
                as usize } , 88usize , concat ! (
                "Alignment of field: " , stringify ! ( defmodule ) , "::" ,
                stringify ! ( visitedFlag ) ));
}
impl Clone for defmodule {
    fn clone(&self) -> Self { *self }
}
pub type Defmodule = defmodule;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct portItem {
    pub moduleName: *mut CLIPSLexeme,
    pub constructType: *mut CLIPSLexeme,
    pub constructName: *mut CLIPSLexeme,
    pub next: *mut PortItem,
}
#[test]
fn bindgen_test_layout_portItem() {
    assert_eq!(::std::mem::size_of::<portItem>() , 32usize , concat ! (
               "Size of: " , stringify ! ( portItem ) ));
    assert_eq! (::std::mem::align_of::<portItem>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( portItem ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const portItem ) ) . moduleName as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( portItem ) , "::" ,
                stringify ! ( moduleName ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const portItem ) ) . constructType as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( portItem ) , "::" ,
                stringify ! ( constructType ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const portItem ) ) . constructName as * const _
                as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( portItem ) , "::" ,
                stringify ! ( constructName ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const portItem ) ) . next as * const _ as usize
                } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( portItem ) , "::" ,
                stringify ! ( next ) ));
}
impl Clone for portItem {
    fn clone(&self) -> Self { *self }
}
pub type PortItem = portItem;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct defmoduleItemHeader {
    pub theModule: *mut Defmodule,
    pub firstItem: *mut ConstructHeader,
    pub lastItem: *mut ConstructHeader,
}
#[test]
fn bindgen_test_layout_defmoduleItemHeader() {
    assert_eq!(::std::mem::size_of::<defmoduleItemHeader>() , 24usize , concat
               ! ( "Size of: " , stringify ! ( defmoduleItemHeader ) ));
    assert_eq! (::std::mem::align_of::<defmoduleItemHeader>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( defmoduleItemHeader ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const defmoduleItemHeader ) ) . theModule as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( defmoduleItemHeader ) ,
                "::" , stringify ! ( theModule ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const defmoduleItemHeader ) ) . firstItem as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( defmoduleItemHeader ) ,
                "::" , stringify ! ( firstItem ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const defmoduleItemHeader ) ) . lastItem as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( defmoduleItemHeader ) ,
                "::" , stringify ! ( lastItem ) ));
}
impl Clone for defmoduleItemHeader {
    fn clone(&self) -> Self { *self }
}
pub type DefmoduleItemHeader = defmoduleItemHeader;

#[repr(C)]
#[derive(Debug, Copy)]
pub struct moduleItem {
    pub name: *const ::std::os::raw::c_char,
    pub moduleIndex: ::std::os::raw::c_uint,
    pub allocateFunction: ::std::option::Option<unsafe extern "C" fn(arg1:
                                                                         *mut Environment)
                                                    ->
                                                        *mut ::std::os::raw::c_void>,
    pub freeFunction: ::std::option::Option<unsafe extern "C" fn(arg1:
                                                                     *mut Environment,
                                                                 arg2:
                                                                     *mut ::std::os::raw::c_void)>,
    pub bloadModuleReference: ::std::option::Option<unsafe extern "C" fn(arg1:
                                                                             *mut Environment,
                                                                         arg2:
                                                                             ::std::os::raw::c_ulong)
                                                        ->
                                                            *mut ::std::os::raw::c_void>,
    pub constructsToCModuleReference: ::std::option::Option<unsafe extern "C" fn(arg1:
                                                                                     *mut Environment,
                                                                                 arg2:
                                                                                     *mut FILE,
                                                                                 arg3:
                                                                                     ::std::os::raw::c_ulong,
                                                                                 arg4:
                                                                                     ::std::os::raw::c_uint,
                                                                                 arg5:
                                                                                     ::std::os::raw::c_uint)>,
    pub findFunction: FindConstructFunction,
    pub next: *mut ModuleItem,
}
#[test]
fn bindgen_test_layout_moduleItem() {
    assert_eq!(::std::mem::size_of::<moduleItem>() , 64usize , concat ! (
               "Size of: " , stringify ! ( moduleItem ) ));
    assert_eq! (::std::mem::align_of::<moduleItem>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( moduleItem ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const moduleItem ) ) . name as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( moduleItem ) , "::" ,
                stringify ! ( name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const moduleItem ) ) . moduleIndex as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( moduleItem ) , "::" ,
                stringify ! ( moduleIndex ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const moduleItem ) ) . allocateFunction as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( moduleItem ) , "::" ,
                stringify ! ( allocateFunction ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const moduleItem ) ) . freeFunction as * const
                _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( moduleItem ) , "::" ,
                stringify ! ( freeFunction ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const moduleItem ) ) . bloadModuleReference as
                * const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( moduleItem ) , "::" ,
                stringify ! ( bloadModuleReference ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const moduleItem ) ) .
                constructsToCModuleReference as * const _ as usize } , 40usize
                , concat ! (
                "Alignment of field: " , stringify ! ( moduleItem ) , "::" ,
                stringify ! ( constructsToCModuleReference ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const moduleItem ) ) . findFunction as * const
                _ as usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( moduleItem ) , "::" ,
                stringify ! ( findFunction ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const moduleItem ) ) . next as * const _ as
                usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( moduleItem ) , "::" ,
                stringify ! ( next ) ));
}
impl Clone for moduleItem {
    fn clone(&self) -> Self { *self }
}
pub type ModuleItem = moduleItem;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct constructHeader {
    pub constructType: ConstructType,
    pub name: *mut CLIPSLexeme,
    pub ppForm: *const ::std::os::raw::c_char,
    pub whichModule: *mut DefmoduleItemHeader,
    pub bsaveID: ::std::os::raw::c_ulong,
    pub next: *mut ConstructHeader,
    pub usrData: *mut userData,
    pub env: *mut Environment,
}
#[test]
fn bindgen_test_layout_constructHeader() {
    assert_eq!(::std::mem::size_of::<constructHeader>() , 64usize , concat ! (
               "Size of: " , stringify ! ( constructHeader ) ));
    assert_eq! (::std::mem::align_of::<constructHeader>() , 8usize , concat !
                ( "Alignment of " , stringify ! ( constructHeader ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const constructHeader ) ) . constructType as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( constructHeader ) ,
                "::" , stringify ! ( constructType ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const constructHeader ) ) . name as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( constructHeader ) ,
                "::" , stringify ! ( name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const constructHeader ) ) . ppForm as * const _
                as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( constructHeader ) ,
                "::" , stringify ! ( ppForm ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const constructHeader ) ) . whichModule as *
                const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( constructHeader ) ,
                "::" , stringify ! ( whichModule ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const constructHeader ) ) . bsaveID as * const
                _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( constructHeader ) ,
                "::" , stringify ! ( bsaveID ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const constructHeader ) ) . next as * const _
                as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( constructHeader ) ,
                "::" , stringify ! ( next ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const constructHeader ) ) . usrData as * const
                _ as usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( constructHeader ) ,
                "::" , stringify ! ( usrData ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const constructHeader ) ) . env as * const _ as
                usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( constructHeader ) ,
                "::" , stringify ! ( env ) ));
}
impl Clone for constructHeader {
    fn clone(&self) -> Self { *self }
}
pub type ConstructHeader = constructHeader;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct moduleStackItem {
    pub changeFlag: bool,
    pub theModule: *mut Defmodule,
    pub next: *mut ModuleStackItem,
}
#[test]
fn bindgen_test_layout_moduleStackItem() {
    assert_eq!(::std::mem::size_of::<moduleStackItem>() , 24usize , concat ! (
               "Size of: " , stringify ! ( moduleStackItem ) ));
    assert_eq! (::std::mem::align_of::<moduleStackItem>() , 8usize , concat !
                ( "Alignment of " , stringify ! ( moduleStackItem ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const moduleStackItem ) ) . changeFlag as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( moduleStackItem ) ,
                "::" , stringify ! ( changeFlag ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const moduleStackItem ) ) . theModule as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( moduleStackItem ) ,
                "::" , stringify ! ( theModule ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const moduleStackItem ) ) . next as * const _
                as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( moduleStackItem ) ,
                "::" , stringify ! ( next ) ));
}
impl Clone for moduleStackItem {
    fn clone(&self) -> Self { *self }
}
pub type ModuleStackItem = moduleStackItem;
pub type AllocateModuleFunction =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut Environment)
                              -> *mut ::std::os::raw::c_void>;
pub type FreeModuleFunction =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut Environment,
                                               arg2:
                                                   *mut ::std::os::raw::c_void)>;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum ConstructType {
    DEFMODULE = 0,
    DEFRULE = 1,
    DEFTEMPLATE = 2,
    DEFFACTS = 3,
    DEFGLOBAL = 4,
    DEFFUNCTION = 5,
    DEFGENERIC = 6,
    DEFMETHOD = 7,
    DEFCLASS = 8,
    DEFMESSAGE_HANDLER = 9,
    DEFINSTANCES = 10,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct callFunctionItem {
    _unused: [u8; 0],
}
pub type CallFunctionItem = callFunctionItem;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct callFunctionItemWithArg {
    pub name: *const ::std::os::raw::c_char,
    pub func: VoidCallFunctionWithArg,
    pub priority: ::std::os::raw::c_int,
    pub next: *mut callFunctionItemWithArg,
    pub context: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_callFunctionItemWithArg() {
    assert_eq!(::std::mem::size_of::<callFunctionItemWithArg>() , 40usize ,
               concat ! (
               "Size of: " , stringify ! ( callFunctionItemWithArg ) ));
    assert_eq! (::std::mem::align_of::<callFunctionItemWithArg>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( callFunctionItemWithArg ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const callFunctionItemWithArg ) ) . name as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( callFunctionItemWithArg
                ) , "::" , stringify ! ( name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const callFunctionItemWithArg ) ) . func as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( callFunctionItemWithArg
                ) , "::" , stringify ! ( func ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const callFunctionItemWithArg ) ) . priority as
                * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( callFunctionItemWithArg
                ) , "::" , stringify ! ( priority ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const callFunctionItemWithArg ) ) . next as *
                const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( callFunctionItemWithArg
                ) , "::" , stringify ! ( next ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const callFunctionItemWithArg ) ) . context as
                * const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( callFunctionItemWithArg
                ) , "::" , stringify ! ( context ) ));
}
impl Clone for callFunctionItemWithArg {
    fn clone(&self) -> Self { *self }
}
pub type CallFunctionItemWithArg = callFunctionItemWithArg;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct boolCallFunctionItem {
    pub name: *const ::std::os::raw::c_char,
    pub func: BoolCallFunction,
    pub priority: ::std::os::raw::c_int,
    pub next: *mut boolCallFunctionItem,
    pub context: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_boolCallFunctionItem() {
    assert_eq!(::std::mem::size_of::<boolCallFunctionItem>() , 40usize ,
               concat ! ( "Size of: " , stringify ! ( boolCallFunctionItem )
               ));
    assert_eq! (::std::mem::align_of::<boolCallFunctionItem>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( boolCallFunctionItem ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const boolCallFunctionItem ) ) . name as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( boolCallFunctionItem )
                , "::" , stringify ! ( name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const boolCallFunctionItem ) ) . func as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( boolCallFunctionItem )
                , "::" , stringify ! ( func ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const boolCallFunctionItem ) ) . priority as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( boolCallFunctionItem )
                , "::" , stringify ! ( priority ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const boolCallFunctionItem ) ) . next as *
                const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( boolCallFunctionItem )
                , "::" , stringify ! ( next ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const boolCallFunctionItem ) ) . context as *
                const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( boolCallFunctionItem )
                , "::" , stringify ! ( context ) ));
}
impl Clone for boolCallFunctionItem {
    fn clone(&self) -> Self { *self }
}
pub type BoolCallFunctionItem = boolCallFunctionItem;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct voidCallFunctionItem {
    pub name: *const ::std::os::raw::c_char,
    pub func: VoidCallFunction,
    pub priority: ::std::os::raw::c_int,
    pub next: *mut voidCallFunctionItem,
    pub context: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_voidCallFunctionItem() {
    assert_eq!(::std::mem::size_of::<voidCallFunctionItem>() , 40usize ,
               concat ! ( "Size of: " , stringify ! ( voidCallFunctionItem )
               ));
    assert_eq! (::std::mem::align_of::<voidCallFunctionItem>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( voidCallFunctionItem ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const voidCallFunctionItem ) ) . name as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( voidCallFunctionItem )
                , "::" , stringify ! ( name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const voidCallFunctionItem ) ) . func as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( voidCallFunctionItem )
                , "::" , stringify ! ( func ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const voidCallFunctionItem ) ) . priority as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( voidCallFunctionItem )
                , "::" , stringify ! ( priority ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const voidCallFunctionItem ) ) . next as *
                const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( voidCallFunctionItem )
                , "::" , stringify ! ( next ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const voidCallFunctionItem ) ) . context as *
                const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( voidCallFunctionItem )
                , "::" , stringify ! ( context ) ));
}
impl Clone for voidCallFunctionItem {
    fn clone(&self) -> Self { *self }
}
pub type VoidCallFunctionItem = voidCallFunctionItem;
pub type int_least8_t = ::std::os::raw::c_schar;
pub type int_least16_t = ::std::os::raw::c_short;
pub type int_least32_t = ::std::os::raw::c_int;
pub type int_least64_t = ::std::os::raw::c_long;
pub type uint_least8_t = ::std::os::raw::c_uchar;
pub type uint_least16_t = ::std::os::raw::c_ushort;
pub type uint_least32_t = ::std::os::raw::c_uint;
pub type uint_least64_t = ::std::os::raw::c_ulong;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum SaveScope { LOCAL_SAVE = 0, VISIBLE_SAVE = 1, }
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum DefaultType {
    NO_DEFAULT = 0,
    STATIC_DEFAULT = 1,
    DYNAMIC_DEFAULT = 2,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum PutSlotError {
    PSE_NO_ERROR = 0,
    PSE_NULL_POINTER_ERROR = 1,
    PSE_INVALID_TARGET_ERROR = 2,
    PSE_SLOT_NOT_FOUND_ERROR = 3,
    PSE_TYPE_ERROR = 4,
    PSE_RANGE_ERROR = 5,
    PSE_ALLOWED_VALUES_ERROR = 6,
    PSE_CARDINALITY_ERROR = 7,
    PSE_ALLOWED_CLASSES_ERROR = 8,
    PSE_EVALUATION_ERROR = 9,
    PSE_RULE_NETWORK_ERROR = 10,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum GetSlotError {
    GSE_NO_ERROR = 0,
    GSE_NULL_POINTER_ERROR = 1,
    GSE_INVALID_TARGET_ERROR = 2,
    GSE_SLOT_NOT_FOUND_ERROR = 3,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum CLIPSType {
    FLOAT_BIT = 1,
    INTEGER_BIT = 2,
    SYMBOL_BIT = 4,
    STRING_BIT = 8,
    MULTIFIELD_BIT = 16,
    EXTERNAL_ADDRESS_BIT = 32,
    FACT_ADDRESS_BIT = 64,
    INSTANCE_ADDRESS_BIT = 128,
    INSTANCE_NAME_BIT = 256,
    VOID_BIT = 512,
    BOOLEAN_BIT = 1024,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct functionCallBuilder {
    pub fcbEnv: *mut Environment,
    pub contents: *mut CLIPSValue,
    pub bufferReset: usize,
    pub length: usize,
    pub bufferMaximum: usize,
}
#[test]
fn bindgen_test_layout_functionCallBuilder() {
    assert_eq!(::std::mem::size_of::<functionCallBuilder>() , 40usize , concat
               ! ( "Size of: " , stringify ! ( functionCallBuilder ) ));
    assert_eq! (::std::mem::align_of::<functionCallBuilder>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( functionCallBuilder ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const functionCallBuilder ) ) . fcbEnv as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( functionCallBuilder ) ,
                "::" , stringify ! ( fcbEnv ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const functionCallBuilder ) ) . contents as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( functionCallBuilder ) ,
                "::" , stringify ! ( contents ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const functionCallBuilder ) ) . bufferReset as
                * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( functionCallBuilder ) ,
                "::" , stringify ! ( bufferReset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const functionCallBuilder ) ) . length as *
                const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( functionCallBuilder ) ,
                "::" , stringify ! ( length ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const functionCallBuilder ) ) . bufferMaximum
                as * const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( functionCallBuilder ) ,
                "::" , stringify ! ( bufferMaximum ) ));
}
impl Clone for functionCallBuilder {
    fn clone(&self) -> Self { *self }
}
pub type FunctionCallBuilder = functionCallBuilder;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum FunctionCallBuilderError {
    FCBE_NO_ERROR = 0,
    FCBE_NULL_POINTER_ERROR = 1,
    FCBE_FUNCTION_NOT_FOUND_ERROR = 2,
    FCBE_INVALID_FUNCTION_ERROR = 3,
    FCBE_ARGUMENT_COUNT_ERROR = 4,
    FCBE_ARGUMENT_TYPE_ERROR = 5,
    FCBE_PROCESSING_ERROR = 6,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct externalAddressType {
    pub name: *const ::std::os::raw::c_char,
    pub shortPrintFunction: ::std::option::Option<unsafe extern "C" fn(arg1:
                                                                           *mut Environment,
                                                                       arg2:
                                                                           *const ::std::os::raw::c_char,
                                                                       arg3:
                                                                           *mut ::std::os::raw::c_void)>,
    pub longPrintFunction: ::std::option::Option<unsafe extern "C" fn(arg1:
                                                                          *mut Environment,
                                                                      arg2:
                                                                          *const ::std::os::raw::c_char,
                                                                      arg3:
                                                                          *mut ::std::os::raw::c_void)>,
    pub discardFunction: ::std::option::Option<unsafe extern "C" fn(arg1:
                                                                        *mut Environment,
                                                                    arg2:
                                                                        *mut ::std::os::raw::c_void)
                                                   -> bool>,
    pub newFunction: ::std::option::Option<unsafe extern "C" fn(arg1:
                                                                    *mut UDFContext,
                                                                arg2:
                                                                    *mut UDFValue)>,
    pub callFunction: ::std::option::Option<unsafe extern "C" fn(arg1:
                                                                     *mut UDFContext,
                                                                 arg2:
                                                                     *mut UDFValue,
                                                                 arg3:
                                                                     *mut UDFValue)
                                                -> bool>,
}
#[test]
fn bindgen_test_layout_externalAddressType() {
    assert_eq!(::std::mem::size_of::<externalAddressType>() , 48usize , concat
               ! ( "Size of: " , stringify ! ( externalAddressType ) ));
    assert_eq! (::std::mem::align_of::<externalAddressType>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( externalAddressType ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const externalAddressType ) ) . name as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( externalAddressType ) ,
                "::" , stringify ! ( name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const externalAddressType ) ) .
                shortPrintFunction as * const _ as usize } , 8usize , concat !
                (
                "Alignment of field: " , stringify ! ( externalAddressType ) ,
                "::" , stringify ! ( shortPrintFunction ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const externalAddressType ) ) .
                longPrintFunction as * const _ as usize } , 16usize , concat !
                (
                "Alignment of field: " , stringify ! ( externalAddressType ) ,
                "::" , stringify ! ( longPrintFunction ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const externalAddressType ) ) . discardFunction
                as * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( externalAddressType ) ,
                "::" , stringify ! ( discardFunction ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const externalAddressType ) ) . newFunction as
                * const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( externalAddressType ) ,
                "::" , stringify ! ( newFunction ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const externalAddressType ) ) . callFunction as
                * const _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( externalAddressType ) ,
                "::" , stringify ! ( callFunction ) ));
}
impl Clone for externalAddressType {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub struct evaluationData {
    pub CurrentExpression: *mut expr,
    pub EvaluationError: bool,
    pub HaltExecution: bool,
    pub CurrentEvaluationDepth: ::std::os::raw::c_int,
    pub numberOfAddressTypes: ::std::os::raw::c_int,
    pub PrimitivesArray: [*mut entityRecord; 150usize],
    pub ExternalAddressTypes: [*mut externalAddressType; 10usize],
}
#[test]
fn bindgen_test_layout_evaluationData() {
    assert_eq!(::std::mem::size_of::<evaluationData>() , 1304usize , concat !
               ( "Size of: " , stringify ! ( evaluationData ) ));
    assert_eq! (::std::mem::align_of::<evaluationData>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( evaluationData ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const evaluationData ) ) . CurrentExpression as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( evaluationData ) , "::"
                , stringify ! ( CurrentExpression ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const evaluationData ) ) . EvaluationError as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( evaluationData ) , "::"
                , stringify ! ( EvaluationError ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const evaluationData ) ) . HaltExecution as *
                const _ as usize } , 9usize , concat ! (
                "Alignment of field: " , stringify ! ( evaluationData ) , "::"
                , stringify ! ( HaltExecution ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const evaluationData ) ) .
                CurrentEvaluationDepth as * const _ as usize } , 12usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( evaluationData ) , "::"
                , stringify ! ( CurrentEvaluationDepth ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const evaluationData ) ) . numberOfAddressTypes
                as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( evaluationData ) , "::"
                , stringify ! ( numberOfAddressTypes ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const evaluationData ) ) . PrimitivesArray as *
                const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( evaluationData ) , "::"
                , stringify ! ( PrimitivesArray ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const evaluationData ) ) . ExternalAddressTypes
                as * const _ as usize } , 1224usize , concat ! (
                "Alignment of field: " , stringify ! ( evaluationData ) , "::"
                , stringify ! ( ExternalAddressTypes ) ));
}
impl Clone for evaluationData {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    pub fn InitializeEvaluationData(arg1: *mut Environment);
}
extern "C" {
    pub fn EvaluateExpression(arg1: *mut Environment, arg2: *mut expr,
                              arg3: *mut UDFValue) -> bool;
}
extern "C" {
    pub fn SetEvaluationError(arg1: *mut Environment, arg2: bool);
}
extern "C" {
    pub fn GetEvaluationError(arg1: *mut Environment) -> bool;
}
extern "C" {
    pub fn SetHaltExecution(arg1: *mut Environment, arg2: bool);
}
extern "C" {
    pub fn GetHaltExecution(arg1: *mut Environment) -> bool;
}
extern "C" {
    pub fn ReturnValues(arg1: *mut Environment, arg2: *mut UDFValue,
                        arg3: bool);
}
extern "C" {
    pub fn WriteUDFValue(arg1: *mut Environment,
                         arg2: *const ::std::os::raw::c_char,
                         arg3: *mut UDFValue);
}
extern "C" {
    pub fn WriteCLIPSValue(arg1: *mut Environment,
                           arg2: *const ::std::os::raw::c_char,
                           arg3: *mut CLIPSValue);
}
extern "C" {
    pub fn SetMultifieldErrorValue(arg1: *mut Environment,
                                   arg2: *mut UDFValue);
}
extern "C" {
    pub fn CopyDataObject(arg1: *mut Environment, arg2: *mut UDFValue,
                          arg3: *mut UDFValue, arg4: ::std::os::raw::c_int);
}
extern "C" {
    pub fn AtomInstall(arg1: *mut Environment, arg2: ::std::os::raw::c_ushort,
                       arg3: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn AtomDeinstall(arg1: *mut Environment,
                         arg2: ::std::os::raw::c_ushort,
                         arg3: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn Retain(arg1: *mut Environment, arg2: *mut TypeHeader);
}
extern "C" {
    pub fn Release(arg1: *mut Environment, arg2: *mut TypeHeader);
}
extern "C" {
    pub fn RetainCV(arg1: *mut Environment, arg2: *mut CLIPSValue);
}
extern "C" {
    pub fn ReleaseCV(arg1: *mut Environment, arg2: *mut CLIPSValue);
}
extern "C" {
    pub fn RetainUDFV(arg1: *mut Environment, arg2: *mut UDFValue);
}
extern "C" {
    pub fn ReleaseUDFV(arg1: *mut Environment, arg2: *mut UDFValue);
}
extern "C" {
    pub fn ConvertValueToExpression(arg1: *mut Environment,
                                    arg2: *mut UDFValue) -> *mut expr;
}
extern "C" {
    pub fn GetAtomicHashValue(arg1: ::std::os::raw::c_ushort,
                              arg2: *mut ::std::os::raw::c_void,
                              arg3: ::std::os::raw::c_ushort)
     -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn InstallPrimitive(arg1: *mut Environment, arg2: *mut entityRecord,
                            arg3: ::std::os::raw::c_int);
}
extern "C" {
    pub fn InstallExternalAddressType(arg1: *mut Environment,
                                      arg2: *mut externalAddressType)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TransferDataObjectValues(arg1: *mut UDFValue, arg2: *mut UDFValue);
}
extern "C" {
    pub fn FunctionReferenceExpression(arg1: *mut Environment,
                                       arg2: *const ::std::os::raw::c_char)
     -> *mut expr;
}
extern "C" {
    pub fn GetFunctionReference(arg1: *mut Environment,
                                arg2: *const ::std::os::raw::c_char,
                                arg3: *mut Expression) -> bool;
}
extern "C" {
    pub fn DOsEqual(arg1: *mut UDFValue, arg2: *mut UDFValue) -> bool;
}
extern "C" {
    pub fn EvaluateAndStoreInDataObject(arg1: *mut Environment, arg2: bool,
                                        arg3: *mut Expression,
                                        arg4: *mut UDFValue, arg5: bool)
     -> bool;
}
extern "C" {
    pub fn ResetErrorFlags(arg1: *mut Environment);
}
extern "C" {
    pub fn CreateFunctionCallBuilder(arg1: *mut Environment, arg2: usize)
     -> *mut FunctionCallBuilder;
}
extern "C" {
    pub fn FCBAppendUDFValue(arg1: *mut FunctionCallBuilder,
                             arg2: *mut UDFValue);
}
extern "C" {
    pub fn FCBAppend(arg1: *mut FunctionCallBuilder, arg2: *mut CLIPSValue);
}
extern "C" {
    pub fn FCBAppendCLIPSInteger(arg1: *mut FunctionCallBuilder,
                                 arg2: *mut CLIPSInteger);
}
extern "C" {
    pub fn FCBAppendInteger(arg1: *mut FunctionCallBuilder,
                            arg2: ::std::os::raw::c_longlong);
}
extern "C" {
    pub fn FCBAppendCLIPSFloat(arg1: *mut FunctionCallBuilder,
                               arg2: *mut CLIPSFloat);
}
extern "C" {
    pub fn FCBAppendFloat(arg1: *mut FunctionCallBuilder, arg2: f64);
}
extern "C" {
    pub fn FCBAppendCLIPSLexeme(arg1: *mut FunctionCallBuilder,
                                arg2: *mut CLIPSLexeme);
}
extern "C" {
    pub fn FCBAppendSymbol(arg1: *mut FunctionCallBuilder,
                           arg2: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn FCBAppendString(arg1: *mut FunctionCallBuilder,
                           arg2: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn FCBAppendInstanceName(arg1: *mut FunctionCallBuilder,
                                 arg2: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn FCBAppendCLIPSExternalAddress(arg1: *mut FunctionCallBuilder,
                                         arg2: *mut CLIPSExternalAddress);
}
extern "C" {
    pub fn FCBAppendFact(arg1: *mut FunctionCallBuilder, arg2: *mut Fact);
}
extern "C" {
    pub fn FCBAppendInstance(arg1: *mut FunctionCallBuilder,
                             arg2: *mut Instance);
}
extern "C" {
    pub fn FCBAppendMultifield(arg1: *mut FunctionCallBuilder,
                               arg2: *mut Multifield);
}
extern "C" {
    pub fn FCBDispose(arg1: *mut FunctionCallBuilder);
}
extern "C" {
    pub fn FCBReset(arg1: *mut FunctionCallBuilder);
}
extern "C" {
    pub fn FCBCall(arg1: *mut FunctionCallBuilder,
                   arg2: *const ::std::os::raw::c_char, arg3: *mut CLIPSValue)
     -> FunctionCallBuilderError;
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct gcBlock {
    pub newGarbageFrame: garbageFrame,
    pub oldGarbageFrame: *mut garbageFrame,
    pub result: *mut UDFValue,
}
#[test]
fn bindgen_test_layout_gcBlock() {
    assert_eq!(::std::mem::size_of::<gcBlock>() , 88usize , concat ! (
               "Size of: " , stringify ! ( gcBlock ) ));
    assert_eq! (::std::mem::align_of::<gcBlock>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( gcBlock ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const gcBlock ) ) . newGarbageFrame as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( gcBlock ) , "::" ,
                stringify ! ( newGarbageFrame ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const gcBlock ) ) . oldGarbageFrame as * const
                _ as usize } , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( gcBlock ) , "::" ,
                stringify ! ( oldGarbageFrame ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const gcBlock ) ) . result as * const _ as
                usize } , 80usize , concat ! (
                "Alignment of field: " , stringify ! ( gcBlock ) , "::" ,
                stringify ! ( result ) ));
}
impl Clone for gcBlock {
    fn clone(&self) -> Self { *self }
}
pub type GCBlock = gcBlock;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct stringBuilder {
    pub sbEnv: *mut Environment,
    pub contents: *mut ::std::os::raw::c_char,
    pub bufferReset: usize,
    pub length: usize,
    pub bufferMaximum: usize,
}
#[test]
fn bindgen_test_layout_stringBuilder() {
    assert_eq!(::std::mem::size_of::<stringBuilder>() , 40usize , concat ! (
               "Size of: " , stringify ! ( stringBuilder ) ));
    assert_eq! (::std::mem::align_of::<stringBuilder>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( stringBuilder ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const stringBuilder ) ) . sbEnv as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( stringBuilder ) , "::"
                , stringify ! ( sbEnv ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const stringBuilder ) ) . contents as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( stringBuilder ) , "::"
                , stringify ! ( contents ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const stringBuilder ) ) . bufferReset as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( stringBuilder ) , "::"
                , stringify ! ( bufferReset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const stringBuilder ) ) . length as * const _
                as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( stringBuilder ) , "::"
                , stringify ! ( length ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const stringBuilder ) ) . bufferMaximum as *
                const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( stringBuilder ) , "::"
                , stringify ! ( bufferMaximum ) ));
}
impl Clone for stringBuilder {
    fn clone(&self) -> Self { *self }
}
pub type StringBuilder = stringBuilder;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct trackedMemory {
    pub theMemory: *mut ::std::os::raw::c_void,
    pub next: *mut trackedMemory,
    pub prev: *mut trackedMemory,
    pub memSize: usize,
}
#[test]
fn bindgen_test_layout_trackedMemory() {
    assert_eq!(::std::mem::size_of::<trackedMemory>() , 32usize , concat ! (
               "Size of: " , stringify ! ( trackedMemory ) ));
    assert_eq! (::std::mem::align_of::<trackedMemory>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( trackedMemory ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trackedMemory ) ) . theMemory as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( trackedMemory ) , "::"
                , stringify ! ( theMemory ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trackedMemory ) ) . next as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( trackedMemory ) , "::"
                , stringify ! ( next ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trackedMemory ) ) . prev as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( trackedMemory ) , "::"
                , stringify ! ( prev ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trackedMemory ) ) . memSize as * const _
                as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( trackedMemory ) , "::"
                , stringify ! ( memSize ) ));
}
impl Clone for trackedMemory {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct garbageFrame {
    pub dirty: bool,
    pub priorFrame: *mut garbageFrame,
    pub ephemeralSymbolList: *mut ephemeron,
    pub ephemeralFloatList: *mut ephemeron,
    pub ephemeralIntegerList: *mut ephemeron,
    pub ephemeralBitMapList: *mut ephemeron,
    pub ephemeralExternalAddressList: *mut ephemeron,
    pub ListOfMultifields: *mut Multifield,
    pub LastMultifield: *mut Multifield,
}
#[test]
fn bindgen_test_layout_garbageFrame() {
    assert_eq!(::std::mem::size_of::<garbageFrame>() , 72usize , concat ! (
               "Size of: " , stringify ! ( garbageFrame ) ));
    assert_eq! (::std::mem::align_of::<garbageFrame>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( garbageFrame ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const garbageFrame ) ) . dirty as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( garbageFrame ) , "::" ,
                stringify ! ( dirty ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const garbageFrame ) ) . priorFrame as * const
                _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( garbageFrame ) , "::" ,
                stringify ! ( priorFrame ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const garbageFrame ) ) . ephemeralSymbolList as
                * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( garbageFrame ) , "::" ,
                stringify ! ( ephemeralSymbolList ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const garbageFrame ) ) . ephemeralFloatList as
                * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( garbageFrame ) , "::" ,
                stringify ! ( ephemeralFloatList ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const garbageFrame ) ) . ephemeralIntegerList
                as * const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( garbageFrame ) , "::" ,
                stringify ! ( ephemeralIntegerList ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const garbageFrame ) ) . ephemeralBitMapList as
                * const _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( garbageFrame ) , "::" ,
                stringify ! ( ephemeralBitMapList ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const garbageFrame ) ) .
                ephemeralExternalAddressList as * const _ as usize } , 48usize
                , concat ! (
                "Alignment of field: " , stringify ! ( garbageFrame ) , "::" ,
                stringify ! ( ephemeralExternalAddressList ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const garbageFrame ) ) . ListOfMultifields as *
                const _ as usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( garbageFrame ) , "::" ,
                stringify ! ( ListOfMultifields ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const garbageFrame ) ) . LastMultifield as *
                const _ as usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( garbageFrame ) , "::" ,
                stringify ! ( LastMultifield ) ));
}
impl Clone for garbageFrame {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct utilityData {
    pub ListOfCleanupFunctions: *mut voidCallFunctionItem,
    pub ListOfPeriodicFunctions: *mut voidCallFunctionItem,
    pub PeriodicFunctionsEnabled: bool,
    pub YieldFunctionEnabled: bool,
    pub YieldTimeFunction: ::std::option::Option<unsafe extern "C" fn()>,
    pub trackList: *mut trackedMemory,
    pub MasterGarbageFrame: garbageFrame,
    pub CurrentGarbageFrame: *mut garbageFrame,
}
#[test]
fn bindgen_test_layout_utilityData() {
    assert_eq!(::std::mem::size_of::<utilityData>() , 120usize , concat ! (
               "Size of: " , stringify ! ( utilityData ) ));
    assert_eq! (::std::mem::align_of::<utilityData>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( utilityData ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const utilityData ) ) . ListOfCleanupFunctions
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( utilityData ) , "::" ,
                stringify ! ( ListOfCleanupFunctions ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const utilityData ) ) . ListOfPeriodicFunctions
                as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( utilityData ) , "::" ,
                stringify ! ( ListOfPeriodicFunctions ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const utilityData ) ) .
                PeriodicFunctionsEnabled as * const _ as usize } , 16usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( utilityData ) , "::" ,
                stringify ! ( PeriodicFunctionsEnabled ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const utilityData ) ) . YieldFunctionEnabled as
                * const _ as usize } , 17usize , concat ! (
                "Alignment of field: " , stringify ! ( utilityData ) , "::" ,
                stringify ! ( YieldFunctionEnabled ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const utilityData ) ) . YieldTimeFunction as *
                const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( utilityData ) , "::" ,
                stringify ! ( YieldTimeFunction ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const utilityData ) ) . trackList as * const _
                as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( utilityData ) , "::" ,
                stringify ! ( trackList ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const utilityData ) ) . MasterGarbageFrame as *
                const _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( utilityData ) , "::" ,
                stringify ! ( MasterGarbageFrame ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const utilityData ) ) . CurrentGarbageFrame as
                * const _ as usize } , 112usize , concat ! (
                "Alignment of field: " , stringify ! ( utilityData ) , "::" ,
                stringify ! ( CurrentGarbageFrame ) ));
}
impl Clone for utilityData {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    pub fn InitializeUtilityData(arg1: *mut Environment);
}
extern "C" {
    pub fn AddCleanupFunction(arg1: *mut Environment,
                              arg2: *const ::std::os::raw::c_char,
                              arg3: VoidCallFunction,
                              arg4: ::std::os::raw::c_int,
                              arg5: *mut ::std::os::raw::c_void) -> bool;
}
extern "C" {
    pub fn AddPeriodicFunction(arg1: *mut Environment,
                               arg2: *const ::std::os::raw::c_char,
                               arg3: VoidCallFunction,
                               arg4: ::std::os::raw::c_int,
                               arg5: *mut ::std::os::raw::c_void) -> bool;
}
extern "C" {
    pub fn RemoveCleanupFunction(arg1: *mut Environment,
                                 arg2: *const ::std::os::raw::c_char) -> bool;
}
extern "C" {
    pub fn RemovePeriodicFunction(arg1: *mut Environment,
                                  arg2: *const ::std::os::raw::c_char)
     -> bool;
}
extern "C" {
    pub fn CopyString(arg1: *mut Environment,
                      arg2: *const ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn DeleteString(arg1: *mut Environment,
                        arg2: *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn AppendStrings(arg1: *mut Environment,
                         arg2: *const ::std::os::raw::c_char,
                         arg3: *const ::std::os::raw::c_char)
     -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn StringPrintForm(arg1: *mut Environment,
                           arg2: *const ::std::os::raw::c_char)
     -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn AppendToString(arg1: *mut Environment,
                          arg2: *const ::std::os::raw::c_char,
                          arg3: *mut ::std::os::raw::c_char, arg4: *mut usize,
                          arg5: *mut usize) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn InsertInString(arg1: *mut Environment,
                          arg2: *const ::std::os::raw::c_char, arg3: usize,
                          arg4: *mut ::std::os::raw::c_char, arg5: *mut usize,
                          arg6: *mut usize) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn AppendNToString(arg1: *mut Environment,
                           arg2: *const ::std::os::raw::c_char,
                           arg3: *mut ::std::os::raw::c_char, arg4: usize,
                           arg5: *mut usize, arg6: *mut usize)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn EnlargeString(arg1: *mut Environment, arg2: usize,
                         arg3: *mut ::std::os::raw::c_char, arg4: *mut usize,
                         arg5: *mut usize) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ExpandStringWithChar(arg1: *mut Environment,
                                arg2: ::std::os::raw::c_int,
                                arg3: *mut ::std::os::raw::c_char,
                                arg4: *mut usize, arg5: *mut usize,
                                arg6: usize) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn AddVoidFunctionToCallList(arg1: *mut Environment,
                                     arg2: *const ::std::os::raw::c_char,
                                     arg3: ::std::os::raw::c_int,
                                     arg4: VoidCallFunction,
                                     arg5: *mut VoidCallFunctionItem,
                                     arg6: *mut ::std::os::raw::c_void)
     -> *mut VoidCallFunctionItem;
}
extern "C" {
    pub fn AddBoolFunctionToCallList(arg1: *mut Environment,
                                     arg2: *const ::std::os::raw::c_char,
                                     arg3: ::std::os::raw::c_int,
                                     arg4: BoolCallFunction,
                                     arg5: *mut BoolCallFunctionItem,
                                     arg6: *mut ::std::os::raw::c_void)
     -> *mut BoolCallFunctionItem;
}
extern "C" {
    pub fn RemoveVoidFunctionFromCallList(arg1: *mut Environment,
                                          arg2: *const ::std::os::raw::c_char,
                                          arg3: *mut VoidCallFunctionItem,
                                          arg4: *mut bool)
     -> *mut VoidCallFunctionItem;
}
extern "C" {
    pub fn RemoveBoolFunctionFromCallList(arg1: *mut Environment,
                                          arg2: *const ::std::os::raw::c_char,
                                          arg3: *mut BoolCallFunctionItem,
                                          arg4: *mut bool)
     -> *mut BoolCallFunctionItem;
}
extern "C" {
    pub fn DeallocateVoidCallList(arg1: *mut Environment,
                                  arg2: *mut VoidCallFunctionItem);
}
extern "C" {
    pub fn DeallocateBoolCallList(arg1: *mut Environment,
                                  arg2: *mut BoolCallFunctionItem);
}
extern "C" {
    pub fn AddFunctionToCallListWithArg(arg1: *mut Environment,
                                        arg2: *const ::std::os::raw::c_char,
                                        arg3: ::std::os::raw::c_int,
                                        arg4: VoidCallFunctionWithArg,
                                        arg5: *mut CallFunctionItemWithArg,
                                        arg6: *mut ::std::os::raw::c_void)
     -> *mut CallFunctionItemWithArg;
}
extern "C" {
    pub fn RemoveFunctionFromCallListWithArg(arg1: *mut Environment,
